[
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Computer Science (Common Entry)", "description": ["If you are interested in computer science or software development, but are unsure as to where you would like to specialise, then Computer Science (Common Entry) is for you. You will learn about the basics of computing/software development, and then decide which of the specialisms you think best suits your personal interests, strengths and plans. Through the use of specialist streams, we can quickly react to industry trends, while always ensuring that you will become a strong programmer/software developer.", "If you know that you are interested in computing and in programming/software development but are not fully sure as to your strengths and/or interests, then this is the programme for you. You get to choose your specialism after first year, when you will know more about those strengths/interests. During year three of the programme, students embark on Work Placement (or study abroad). Most students find paid employment during this time.", "In particular, as a graduate of this programme, you will:", "Have excellent programming skills", "Be an excellent problem solver", "Have unrivalled employment prospects (most students have job offers before they sit their final year examinations)", "This is a four-year full-time programme, and will prepare you for an exciting career in computer science and software development with specialisms in", "This degree programme is the longest running in SETU Waterford and our graduates are amongst the most nationally sought-after computing graduates."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science Information Technology", "description": ["In today's digital world, technology isn't just about gadgets and apps; it's about solving real-world problems and shaping the future. It's about turning ideas into reality and making a difference in people's lives. That's the heart of our BSc in Information Technology programme.", "This degree isn't just a ticket into the tech industry; it's a launchpad to a future where you're the innovator, the problem-solver, the one who's making the world a better place through technology.", "Our BSc in Information Technology is not just about coding. It's about understanding the impact of technology on society, it's about learning how to think critically, solve problems, and develop solutions that matter. You'll learn to work with modern technologies like cloud computing, networking and security, but you'll also learn how to identify and solve the challenges that businesses and society face.", "In this course, we don't just teach you skills, we teach you how to learn. Because in the tech industry, things change fast. The tools and technologies that are popular today might be obsolete tomorrow. But with a solid foundation in problem-solving, a deep understanding of technology, and the ability to learn and adapt, you'll be prepared to keep up with any changes that come your way.", "So, if you want to be more than just a consumer of technology - if you want to be a creator, an innovator, a leader - then our BSc in Information Technology is the right choice for you. You'll not only gain the technical skills you need to succeed, but also the problem-solving abilities, creative thinking, and adaptability that will make you stand out.", "Join our course, and let's start building a better future, together."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Creative Computing", "description": ["Ireland's globally recognised digital and creative economy has experienced significant growth in recent years. Enterprise Ireland aims to expand even further the export footprint of this growing sector, and skilled workers are required to do this. Our graduates will be qualified to fulfill the needs of this sector and many others.", "This is a four year course designed to provide students with the knowledge and practical experience of industry standard innovative tools and technologies, within the domains of technology and creative media. The course is primarily a computing course specialising in creative media, with approximately 60% computing content and 40% creative media content. It is a very practical based course where students develop skills through a strong emphasis on project work and continuous assessment. Graduates are highly employable allowing them to pursue a career in both the computing and creative media industry. If you would like to study a Computer Science Course and you also like Creative Media, this might be the course for you!", "Students study core computing subject areas, such as Web and Mobile Development, Computer Science and Databases, with creative subject areas such as UX (User Experience) Design, Graphic Design, Animation and Media Production.", "Students can choose the option of Industry Placement during Flexible Semester in year 3. This allows academic theory to be put into practice while gaining valuable insights into working life. Industry Placement enhances employability and kick-starts the creation of a network of potential contacts for future careers. Along with Industry Placement, there are a number of alternative options available during Flexible Semester."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science Creative Computing", "description": ["Creative Computing aims to provide students with the cross disciplinary skills of computing and creative media. Graduates will be skilled in both computing and multimedia to work in today’s highly dynamic, high-tech digital environment. If you would like to study a Computing Course and you also have a creative ability, this might be the course for you!", "This is a three year course designed to provide students with the knowledge, skills and practical experience in computing and creative media. Students study approximately 60% computing in core areas, such as Web and Mobile Development, Networks and Databases, and 40% in creative media, such as UX Design, Graphic Design, Animation and Media Production. Our students use industry standard innovative tools and technologies, to become proficient in programming and creative media to create custom-built interactive applications. The flexible semester facilitates professional development, enhances knowledge and technical skills, through industry placement and other opportunities.", "There is an increasing demand for IT professionals with the skillset required to drive and support the computing and creative media industry. Our graduates are modern computer science and creative media professionals with the knowledge and skillset to work in the domains of technology and creative media."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Software Systems Development", "description": ["The programme is designed to equip you with the skillset required to work in an array of computing roles in industry. You will develop secure software with the most modern methods of software technology for all areas of application, and you will have the ability to analyse, select, and utilise appropriate emerging technologies for the development of a software solution. You will be able to store, manage and mine data for businesses, and to develop systems to enable organisations to extract value from such data.", "People and businesses such as Google, Facebook and Amazon generate vast amounts of data every day with each person leaving a digital footprint across the web. There is a demand for high quality software developers with multi-disciplinary skills and this programme will produce software developers, who can analyse this data for businesses to give them a competitive advantage, by equipping them with core skills in data science and information systems allied to excellent software development skills.", "This programme provides you with the opportunity to become a well-rounded software developer with a background in either business, psychology, or a European language.", "There is a strong focus on programming and website fundamentals to provide you with a solid background for later years. You will be also introduced to software engineering concepts, and fundamental computing concepts using Raspberry PI’s for example.", "In years 2, 3, and 4 you will study specialist modules in mobile and web app development, database systems, business analytics, information systems and computer security.", "Companies in Ireland are seeking software developers who possess multi-disciplinary skills in the areas of Business, Psychology or Languages. With this in mind you will have the option to study those areas as elective option from year 2.", "In year 3 you have the option to complete work placement or study abroad. Studying abroad has become a popular choice for all our students especially those who have chosen the European language elective."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science Software Systems Development", "description": ["The BSc in Software Systems Development is a three year ordinary degree course. In this degree programme students will learn how to design, develop, and maintain software applications such as interactive web sites, mobile apps, database applications, and business intelligence tools.Our students also have the option to choose and elective stream of modules in either business, languages or psychology.", "On completion of the programme, students will have the skillset necessary to become competent software developers and business analysts; and students will have the necessary skills and knowledge to meet the needs of today’s software industry. The course will also equip the student with the other skills required to work in the software systems industry, including the ability to work as part of a development team, and the ability to work with the system user through all stages of system development.", "The aim is to enable students to develop software with the most modern methods of software technology for all areas of application.", "The course includes a flexible learning semester in year three. The flexible semester is a non-contact semester and consists of one of the following options:", "Graduates may progress to the BSc (Hons) in Software Systems Development or the BSc (Hons) in IT or may find employment in the following positions:"]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Computer Forensics and Security", "description": [", per Sunday Times &", "Read about the great job opportunities SETU Waterford graduates from this course have had -", ".", "The BSc (Hons) in Computer Forensics & Security is a four year honours degree course equipping graduates with the specialised skills and knowledge needed to secure, monitor and examine electronic crime scenes and digital environments. This is a computer science degree with a specialism in the securing, monitoring and investigating of computers, digital devices and data. It also covers programming, computer networks, operating systems and web technologies. It allows you to investigate, decode and decipher the digital world in which you live.", "People generate vast amounts of data every day with each person leaving a digital footprint across the web. Your data is used by companies to sell you products and to see what you are interested in. Your data is also used by hacktivists, cyber criminal gangs and different states that are engaged in a cyberwar and information war with these companies and with each other. Data, in the 21st century, is more valuable than oil. You need to control and protect your data, and the data of others. Understanding this area allows you to protect everything in your life, such as family, friends, energy, money, transport, even the food and water you consume.", "Just as a murder scene needs to be secured so too do electronic crime scenes. There are particular ways of securing evidence and students learn how to do this. Electronic crime scenes often involve child pornography, blackmail, financial fraud and data theft. Criminal prosecutors have used computer forensic evidence to form the backbone in murder cases and robberies through the use of technologies such as mobile phone forensics.", "Computer forensics is the application of the scientific method to digital media in order to establish factual information for judicial review. This process often involves investigating computer systems to determine whether they are or have been used for illegal or unauthorised activities.", "You will study specialised subjects such as secure programming, cryptography, law, filesystem forensics, network and online forensics, emerging device forensics, and web application security, as well as core computer science subjects such as programming, computer networks, web and mobile application development, maths and statistics, computer and operating systems, and data mining.", "You will learn how data works at a low level, how it is stored and accessed on any digital device, what happens when you press File> Save As at the level of 1’s and 0s’. You will discover how to keep your data secure, safe and encrypted. You will be able to sniff packets from a computer network and look inside them or analyse where the traffic on the network is going, and what it is doing. You will examine websites and applications to see how they are vulnerable to attack and will learn how to ethically hack and perform penetration tests on computer systems. You will learn how to use open-source intelligence techniques to ethically find out information about people online and to investigate digital devices such as phones or Internet of Things devices. You will be able to act as an expert witness in court and know how your actions affect evidence. You will discover patterns and trends in data that others don’t see and will be able protect what you do in today’s digital world. This programme differs from the Computer Forensics and Security stream on the BSc (Hons) in Applied Computing by an emphasis on Operating Systems rather than Physics."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Computer Science (Games Development)", "description": ["The BSc (Hons) in Computer Science (Games Development) is a full-time, four year, honours degree course of study that can be chosen within the", ".", "Game developers design and create video games for computers and mobile devices. Students will develop a portfolio of playable games and game prototypes using high-level game development tools such as Unity and Unreal. In addition they will develop proficiency in high performance game development using industry-standard languages such as C++, C# and Javascript. Genres of games which students will develop include 2D side-scrolling platformers, first-person shooters and survival games in 2D/3D. Students will develop skills to enable them to create games ranging in technical complexity from indie and casual games up to AAA high-end commercial games.", "Students take part in a (paid) work placement in semester 6. This placement takes place in a software house or the IT department of a large company or industry. Companies such as IBM and Microsoft have a long association with the placement of our students. Students have found this an invaluable experience.", "There have been huge developments in the ways in which we use technology in 2013, compared with 2003 and many of them are up for discussion in this episode of Reboots & Remixes. Smartphones, tablets, social media, YouTube, Skype, gaming - and we're only scratching the surface.", "This episode was written, edited and produced by Sean Bray and Rob O'Connor.", "Features contributions from Eamonn de Leastar (TSSG), Danny O'Dwyer (Gamespot), Dr. Niamh Murphy (SETU Waterford) and Stuart Clarke (Hotpress)."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Computer Science (Internet of Things)", "description": ["The BSc (Hons) in Computer Science  (Internet of Things) is an exciting course developed in conjunction with the University's world class research groups", "Institute,", "and", ". You will learn how to program the next wave of connected devices, you will explore the software and hardware that is transforming the world, connecting things to create radical new services and products.", "Ultimately, you will become a software practitioner who understands mobile, cloud and connected devices and understand how these devices can be designed, interfaced with and operated. The Walton Institute  has completed dozens of research projects in IoT, has hundreds of international partners and a fantastic campus at Carriganore. Walton researchers and the ArcLabs family of startups and spinouts underpin this programme and provide a terrific environment for learning and innovation in this fast moving world", "The Internet of Things (IoT) refers to everyday objects, which have the ability to harvest information, the intelligence to process the information, and the connectivity capabilities to communicate the results. IoT enables and facilitates smart cities, smart environment, smart agriculture as well as major improvements in industrial applications, security & emergency operations, health monitoring and home automation.", "The BSc (Hons) in Computer Science (Internet of things) is a full-time, four year, honours degree course of study that can be chosen within the", ".", "This course is designed to equip students with the skills & knowledge to become Internet of Things practitioners who are comfortable when dealing with the many kinds of devices and systems that connect the Internet and the environment. Such competence must be built on an awareness of the various means with which devices and systems perform, how they can be made to perform well and how their performance attributes may be changed.", "The Internet of Things stream will start to build this competence with the single board computer, the single board micro-controllers and fundamental analogue electronics, which when combined together will afford the environmental input-output capability with basic access to the network. The single board micro-controllers combined with the fundamental analogue topics will give ready access to the analogue and low-level digital world, whose key parameters of interest can be sensed and if necessary conditioned for conversion into digital form, as well as offering an effective actuation interface for analogue change.", "Protocol-defined communications covering all aspects from framing commands and information to the hierarchy of reliable communications will open up the ability to convey information and commands over various media types and allow the candidates a complete education in more complex microcontroller based internet access points.", "In keeping with IoT trends, the programme will avail of open, web-based technologies and accessible electronic devices that are driving the emergence of IoT. Students will be encouraged to connect and incorporate their own personal devices in project work. They will programme diverse devices, including embedded sensors, mobile phones, single board computers and cloud systems. e.g. Raspberry Pi", "Students will also share and disseminate their work using industry standards and collaborative tools, such as github, building a digital portfolio of work, which will allow them to showcase their broad spectrum of skills to potential employers.", "To complement the core expertise in the Department of Computing & Mathematics and the Department of Engineering Technology, the programme development team encompasses expertise from the SETU Waterford research community active in the IoT domain. In particular the combined expertise of research teams at", ",", "and", "have strongly influenced the course and researchers from these groups will be part of the delivery team.", "The", "is an internationally recognised centre of excellence for ICT research and innovation. It carries out a wide spectrum of industry-informed research in Information and Communications Technologies (ICT), particularly technologies enabling communications and information services. TSSG has engaged in IoT.", "The", "is a", "multi-disciplinary research cluster combining expertise in the trans disciplinary fields necessary to deliver innovative solutions for industry applications that seek to leverage from synergistic combinations of nano-bio-info-cognitive (NBIC) technologies.", "The", "is active in advanced research on Automotive Systems.", "Its main focus is on software and electronic systems applicable to automotive applications, automotive networks, vehicle diagnostics, embedded automotive software development and automotive system modelling and simulation"]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Computer Science (Computer Forensics & Security)", "description": ["Just as a murder scene needs to be secured so too do electronic crime scenes. There are particular ways of securing evidence and students learn how to do this. Electronic crime scenes often involve child pornography, blackmail, financial fraud and data theft. Criminal prosecutors have used computer forensic evidence to form the backbone in murder cases and robberies through the use of technologies such as mobile phone forensics.", "Computer forensics is the application of the scientific method to digital media in order to establish factual information for judicial review. This process often involves investigating computer systems to determine whether they are or have been used for illegal or unauthorised activities.", "The BSc (Hons) in Computer Science (Computer Forensics & Security) is a full-time, four year, honours degree course of study that can be chosen within the", ". This course is designed to equip graduates with the specialised skills and knowledge needed to secure, monitor and examine electronic crime scenes and digital environments.", "This stream will develop a strong underlying knowledge of how data, storage and communications work down to bit level. Graduates are aware of the value of data in storage and in transit and the need for security. When reconstructing what has happened on a digital device, they are able to adapt to the use of new tools to aid in their analysis. They explore issues relating to system and network security as well as ethical hacking techniques for penetration testing.", "Students will learn how to respond to a suspicious incident and the importance their actions can have. They will also learn how to collect and examine network data for types of evidence as well as to generate statistical, session and alert information. Being a strong programmer helps with skills such as secure software development and reverse engineering. Modules in law and business help prepare the graduate for working a range of roles that they may pursue as a career."]},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Computer Science (Cloud & Networks)", "description": ["The BSc (Hons) in Computer Science (Cloud and Networks) is a full-time, four year, honours degree course of study that can be chosen within the", ". This course is designed to equip students with a practical understanding of Operating Systems and the tools required to deploy, manage and troubleshoot the underlying infrastructure supporting networked systems.", "This stream will develop a strong underlying knowledge of how network communications and Cloud infrastructure is designed, implemented and managed. Students will work with the latest technologies from leading companies such as Amazon, Cisco, Red Hat and IBM. Graduates who are able to configure, manage and troubleshoot applications and services in Cloud based systems are in high demand across many domains.", "Students will learn how to configure reliable, fault-tolerant, secure Cloud infrastructure systems using popular environments such as Amzon Web Services and Google Cloud Platform. Students will take some modules from the Security stream to develop the essential skills required in modern Cloud environments."]},
{"institution": "Dundalk Institute of Technology", "level": "Postgrad", "course_title": "MSc in Computing1-2 Years (Full time or Part-time)", "description": "Communication skills and research are key skills embraced here as students enhance their knowledge through research led dissertation, student presentations and group work. The programme may run in both on a full- time and part-time basis and because of its modular nature includes the possibility of registering for individual modules, contact us for further information. Students will develop advanced skills and knowledge in the areas of software development, project management, research capabilities and entrepreneurial skills. Graduates of this programme will be capable of: Designing, managing and developing complex quality-assured software systems; Identifying computing problems that require further research and developing research strategies for the investigation of these problems; Analysing and critically evaluating emerging technologies and trends in the computing industry from a business opportunity perspective; Taking responsibility for the work of individuals and groups, and will develop a high level of competence in initiating, leading and managing technology projects and processes."},
{"institution": "Waterford Institute of Technology", "level": "Undergraduate", "course_title": "Bachelor of Science (Honours) Computer Science (Automotive & Automation Systems)", "description": ["Advances in automotive technology have resulted in a rapid growth in innovative features such as driverless cars and collision avoidance. These features require sophisticated software that can sense and interpret the environment around them. Similarly, high-tech industries are embracing new smart manufacturing technologies whereby industrial systems can communicate and cooperate to improve efficiency.", "The BSc (Hons) in Computer Science (Automotive and Automation Systems) is a full-time, four year, honours degree course of study that can be chosen within the", ". This course is designed to equip students with the specialist knowledge and practical skills required for employment in the automotive and automation sector. Both Irish-based and overseas companies seek skilled graduates who are able to create innovative software solutions for the automotive industry.", "Through ongoing collaboration with industrial partners, students gain access to state of the art tools, processes and technologies used in this sector, covering a range of topics such as embedded software development, driver assistance systems, industrial automation, and automotive software design. This knowledge and skillset are not only sought after in the automotive and automation industry, but also in aerospace and other embedded software engineering environments."]},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Master of Science Computing (Information Systems Processes) (full time)", "description": ["The MSc in Computing (Information Systems Processes) programme is designed to enhance the participants’ ability to contribute to the digital transformation of organisations across a range of industries. A combination of technological, management, and organisational perspectives equip graduates with a range of transferable skills.", "Digital systems are transforming every process, from manufacturing to financial services, from customer support to supplier relationships, from government departments to the United Nations. These transformations involve a complex interweaving of human and machine. This programme carefully balances technological, management and organisational perspectives to provide graduates with the insight, tools and skills they need to manage the complex realities of digital transformation."]},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Higher Diploma in Science Data Analytics", "description": ["The H.Dip. in Science in Data Analytics primarily seeks to reskill level 8 graduates from non-computing or mathematics disciplines with the skills to distill a competitive advantage from their employer’s, and publicly available, data. This course will enable graduates to collect, store, secure, share and analyse data to gain maximum information from the data for the benefit of their business or organisation.", "The student will acquire and develop skills in R, Python, SQL and NoSQL. The statistical and mathematical tools will be presented in a distinctly applied manner with the appropriate software package doing the heavy lifting. Students will also explore the benefits of visualisation packages such as Tableau.", "The Department of Computing & Mathematics in SETU is uniquely positioned to deliver this programme as it is a perfect marriage of both disciplines of computing and mathematics. We have a team of academics who understand the theory underpinning such a programme while having experience of engaging in industry projects through two of SETU’s Enterprise Ireland Technology Gateways in the Walton Institute and the PMBRC.", "The Higher Diploma in Science in Data Analytics is a 2-year conversion course delivered online to allow students acquire data analytics' skills to prepare them for a career in this area. Lectures are delivered live each week with recordings available for students to review afterwards. There is a strong emphasis on practical skills with dedicated support throughout.", "Prospective students should anticipate that the time commitment is significant, probably averaging 15 hours per week. However, the return for such effort will be very much worth it."]},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Higher Diploma in Science Production Management for Digital Animation", "description": ["The course is structured around the established workflow phases of a typical animated feature and was designed following extensive dialog with relevant enterprise partners (eg Cartoon Saloon, Brown Bag Films). As a result, the course targets immediate and identified needs of the Animation Industry. All modules reflect industry Project Management best practice. Semesters 1 and 2 address the critical production workflow and related project management disciplines. While Semester-3 offers Work Placement and Mentorship in association with Enterprise Partners.", "The philosophy of the HDip in Animation Production is to blend the creative (observation, artistic conception  and an understanding of the traditional principles of animation) and the technical (Animation and Post Production Tools) with relevant management and strategic planning skills specific to the Digital Animation Industry. The course team will be regularly augmented by associated tutors and specialists from industry", "The HDip is open to level 8 graduates from a range of disciplines. Including Computing, Arts, Visual Media, Gaming and Business.", "It adds its own unique Animation stamp with a focus on the Animation Pipeline,  Software & Hardware Tools, and Project Management. Target job roles for graduates include:", "The course is aimed at those interested in or working in the exciting field of animation and media. The HDip Production Management in Digital Animation is a one-year full-time course with a two-year Part-Time option (online). The course will be delivered in a unique hybrid classroom mode. This means that both face to face and online delivery will take place simultaneously."]},
{"institution": "Dundalk Institute of Technology", "level": "Undergrad", "course_title": "BSc (Hons) Computing in Games Development", "description": ""},
{"institution": "Dundalk Institute of Technology", "level": "Undergrad", "course_title": "BSc (Hons) in Computing", "description": ""},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Higher Diploma in Science Computer Science ( 2-year Online )", "description": ["The ONLINE", "is a 24-month ICT Conversion Course designed to allow honours graduates from non-computing disciplines to acquire the industry-relevant ICT and software development skills, expertise and practical experience required to become suitable candidates for employment in the ICT domain in general and in software development in particular.", ":  The course is delivered using our award-winning online delivery platform – TutorStack, in Agile Semesters typically consisting of 4, three-week sprints followed by 1-week breaks for retrospective, after each sprint.", "Average time commitment is 16 hrs per week. Online delivery over the two years is supplemented by four onsite workshops to further enhance and deepen the learning experience.", "The course is 90% funded by Government for employed people who will pay 10% of the total programme fee - please reference", ".", "The course is fully funded for unemployed people and people returning to formal employment - please see", "Fee ( Payable by employed people) €900", "Module(s) Preview:", "Please click on the video presentation below to get an indepth preview of the course content and structure."]},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Certificate in User Experience & Design", "description": ["This module guides you through the life cycle process of becoming a UX designer.  The module focuses upon the creative, strategic & technical skills required in designing user experiences (UX). As part of this module you will develop a portfolio of work which may be used to showcase your skills in all aspects of the UXD process. Using a combination of theory & practice you will:"]},
{"institution": "Munster Technological University - Kerry Campus", "level": "Postgrad", "course_title": "Master of Science by Research (Computing Department)", "description": ""},
{"institution": "Munster Technological University - Kerry Campus", "level": "Postgrad", "course_title": "Master of Arts by Research and Thesis", "description": ""},
{"institution": "Maynooth University", "level": "Postgrad", "course_title": "MSc Computer Science (Software Engineering)", "description": "The emphasis of the MSc in Computer Science (Software Engineering) is on the principles of good scientific software engineering practice, grounded in a hands-on understanding of the applicability of these practices, so that successful participants will be able to design and lead major software engineering projects. Topics include requirements engineering, system design, testing strategies, software development and augmented software development, with an overall emphasis on the development of reliable software systems. The course is designed to give participants a strong foundation in advanced computer science topics ensuring longevity of their skills and their ability to adapt in a rapidly evolving field. Each module is delivered as a series of intensive lectures. Each module also has associated practical work. Participants submit a dissertation based on a Software Engineering topic. Course Duration: 1 Year Full Time http://apps.nuim.ie/courses/?TARGET=QS&MODE=VIEW&TARGET_SOURCE=QUALIFICATION&QUALIFICATION_CODE=MCSF1 For more details on the course structure click here"},
{"institution": "Maynooth University", "level": "Postgrad", "course_title": "MSc Computer Science (Applied)", "description": "The MSc in Computer Science (Applied) offers students with degrees that include three years of Computer Science a personalised programme of advanced CS modules to enhance their knowledge and fit their strengths. Furthermore, students deepen their research and practical skills through a project and dissertation plus an industrial work placement meaning they will get the opportunity to apply the skills from the lecture hall and the research laboratory in a real industrial environment. This will be a key part of their training and enhance their employment prospects following their graduation. Commences September The course lasts two years. In year one, students will do 12 taught modules selected to complement their previous experience and knowledge. In year 2, semester 1 consists of an advanced module in programming plus a choice of optional modules. In addition, student undertake a major individual software project and preparation for work placement. In semester 2, students are placed within software companies to gain at least six months of relevant work experience. Course Duration: 2 years Full-time http://apps.nuim.ie/courses/?TARGET=QS&MODE=VIEW&TARGET_SOURCE=QUALIFICATION&QUALIFICATION_CODE=MSCF2 For more details on the course structure click here"},
{"institution": "Munster Technological University - Kerry Campus", "level": "Undergrad", "course_title": "[Level 8] Bachelor of Science (Honours) in Computing with Software Development", "description": ""},
{"institution": "Maynooth University", "level": "Postgrad", "course_title": "Higher Diploma in Science (Software Development) F/T", "description": "The Higher Diploma in Science (Software Development) MHG70 is a one-year programme for graduates with degrees in ANY subject giving them a practical introduction to software development including programming, software design and testing, team project work. It is designed to give students practical skills for use in the software industry as programmers, software designers and testers and to bring students to the standard for industrial accreditation as programmers. Commences: Commences (2 nd September 2024) three to four weeks before the start of the academic term. Progression to the MSc in Software Engineering (MHG50) Graduates of the Higher Diploma in Software Development ( MHG70 ) who hold a first-class honour in this course and who demonstrate a strong programming ability, are welcome to apply for entry to our 1-year MSc programme in Software engineering (course code: MHG50 ). Students who hold other level 8 diplomas courses in computing, software development, or software engineering are also welcome to apply for MHG50 . Visit MHG50 at: https://www.maynoothuniversity.ie/study-maynooth/postgraduate-studies/courses/msc-computer-science-software-engineering-one-year-programme https://www.maynoothuniversity.ie/study-maynooth/postgraduate-studies/courses/msc-computer-science-software-engineering-one-year-programme Springboard plus is co-funded by the Government of Ireland and the European Union Eligible students may apply for Springboard funding for MHG70 (see the How to Apply section) Visit at: https://eur02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.maynoothuniversity.ie%2Fcomputer-science%2Fspringboard&data=05%7C01%7CJoseph.Duffin%40mu.ie%7C0ea4fc3bd81d4493b26a08dbf5b33f8c%7C1454f5ccbb354685bbd98621fd8055c9%7C0%7C0%7C638373922427582409%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=2bawSfEXYPIGYs6HSPjTOotOh3TbdF0Kj%2Bx9Qqs0vMs%3D&reserved=0 https://www.maynoothuniversity.ie/computer-science/springboard Teaching and learning will be through lectures, practical lab sessions, and directed reading as required for the different subjects. Module delivery is not just a scheduled series of topics, but rather balanced to meet the needs and progression rates of the students. The course places a balance between learning the fundamentals of the subject, and applying them in practice. Assessment is handled in a similar manner, with most modules having a combination of practical assessment during the delivery of the module, and an examination at the end of the semester. Typically module material is also made available through eLearning tools (primarily Moodle) allowing students to revise at their own pace. Additional tutorials are used, where required, to assist students who may have problems with particular aspects of a module. Course Duration: 1 year Full-time http://apps.nuim.ie/courses/?TARGET=QS&MODE=VIEW&TARGET_SOURCE=QUALIFICATION&QUALIFICATION_CODE=HDSSDF For more details on the course structure click here"},
{"institution": "Maynooth University", "level": "Postgrad", "course_title": "Higher Diploma in Science (Computer Science)", "description": "The Higher Diploma in Science (Computer Science) MHG58 is a postgraduate course intended for graduates whose level 8 primary degree included 3-years study of Computing. On completion of the course participants would be expected to reach a level of competence equivalent to that of a four year BSc graduate in Computer Science. Commences September Students choose, subject to module prerequisites, 9 modules; modules chosen must not have been covered at this level in a previous qualification. In addition a project is required. Course Duration: 1 year Full-time http://apps.nuim.ie/courses/?TARGET=QS&MODE=VIEW&TARGET_SOURCE=QUALIFICATION&QUALIFICATION_CODE=HDCSC For more details on the course structure click here"},
{"institution": "Maynooth University", "level": "Undergrad", "course_title": "BSc in Data Science", "description": "Data Science is the science of collating, managing, analysing, visualising and understanding data. It is key to unlocking the hidden wisdom that is stored in the vast amounts of data available in todays world. Data Science students study statistics, computer science and mathematics and crucially will learn to appreciate the overlap between eliciting valuable information from data through statistical reasoning and managing databases via complex manipulations. If you want to play a central role in solving the worlds critical problems through data, or play an influential role in developing the next generation of Artificial Intelligence then this degree programme is for you. By choosing this degree you will become equipped with tools to collect and manage large volumes of raw data, to develop statistical models and understand their mathematical underpinnings, and to unlock valuable information stored within local, national and global datasets. In other words, you will become exceedingly data literate! Data literacy is one of the most highly sought after skills by employers in todays data driven world, be it in business, science, health or social sciences. This degree programme will make you extremely attractive to employers and give you the power to make the world a better place through channelling your analytical skills to solving global problems such as climate change, developing new drugs or eliminating world hunger. http://apps.maynoothuniversity.ie/courses/?TARGET=QUALIFICATION&MODE=VIEW&SUBJECT_CODE=&OFFERING_CODE=U_HONS_DEGREES&QUALIFICATION_CODE=DSCI For more details on the course structure click here"},
{"institution": "Institute of Technology Carlow", "level": "Certificate", "course_title": "Higher Certificate Science in Computing (with Options in Computer Applications, Commercial Programming, Computer Networking)", "description": "What is the Course about? Computing is the study of how computers and computer systems work and how they are constructed and programmed. As computing increasingly impacts on every aspect of our lives, it is also becoming a more evolved and complex area. While computing may be of general interest to students, it’s often difficult to know which area of specialisation will be of most interest. This course has been designed to give students the broadest possible choice before choosing a specialisation. Course Structure This course provides a general overview of computing in Year 1 and includes modules in mathematics, programming, hardware, operating systems, networking and applications. In Year 2, students may choose to specialise in computer applications or programming. Applications option: This option examines the assembly and secure administration of computer systems and networks and web development. Graduates of this option often go on to work in systems administration, IT support and networking. Programming option: This involves the detailed analysis, design and programming of computer software. Graduates from this area go on to work as programmers in the world of business or as software support and sales representatives. Is this course for you? Are you curious about all kinds of technology? Do you dream of being the superhero who keeps vital networks safe? Or the software expert who makes the world a better place? Would you like to gain highly-prized skills that are in demand across the globe? Do you want to keep the widest possible range of career options open to you? If so, then this is the course for you. Special Features: Year 1 of the course is examined on a continuous assessment basis with no end-of-year exams. This course offers students the opportunity to study a broad range of computing subjects before they choose an area in which to specialise."},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "Bachelor of Science Software Development", "description": "What is the Course about? Software development is the creation and maintenance of software products. These products range from mobile phone apps to highly complex software control systems such as those found in self- driving cars. In the broader sense, it includes everything from initial concept identification and design through to the final production of software. It can include identification of required software, analysis of software requirements, system design, programming, testing and maintenance. Course Structure This course equips students with the range of skills required to become competent software developers. Students follow our new ‘learning-by-doing’ model in first year with continuous assessment replacing final exams. Modules for the first three years include a broad range of subjects and an industry work placement. Year 4 concentrates on state-of-the-art, high-level software development topics such as: secure app development, data science, distributed systems and an extensive project. Is this course for you? Always on the cutting edge and working with the new ideas and technology, software developers enjoy working in diverse teams and solving novel problems with practical solutions. If you have an open, logical and inquiring mind then software development may be the profession for you. Special Features: Dedicated software development laboratory for 3rd year students sponsored by UNUM. Active participation by students in national and international competitions. SETU Carlow Software Development students were recently awarded 2nd place in FIWARE ‘Smart Society’ competition in Seville, winning €40,000 in prize money for their ‘My people Care’ project. SETU Carlow maintains widespread collaborations with international third-level institution computing departments and has active research links with the Netherlands, France, China, Norway, Hungary and the UK. The computing department continues to collaborate with may industry leaders in computing. For example Intel sponsored the use of the Galileo development board and Quark chip at the Institute and this leading edge technology was incorporated into several undergraduate and graduate research projects at SETU Carlow. Exit Awards: Higher Certificate in Computing (NFQ Level 6) after Year 2."},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "Bachelor of Science (Honours) Software Development", "description": "What is the Course about? Software development is the creation and maintenance of software products. These products range from mobile phone apps to highly complex software control systems such as those found in self driving cars. In the broad sense, it includes everything from initial concept identification and design through to the final production of software. It can include identification of required software, analysis of software requirements, system design, programming, testing and maintenance. Course Structure This course equips students with the range of skills required to become competent software developers. Students follow our new ‘learning-by-doing’ model in first year with continuous assessment replacing final exams. Modules for the first three years include a broad range of subjects and an industry work placement. Year 4 concentrates on state-of-the-art, high-level software development topics such as: secure app development, data science, distributed systems and an extensive project. Is this course for you? Always on the cutting edge and working with the new ideas and technology, software developers enjoy working in diverse teams and solving novel problems with practical solutions. If you have an open, logical and enquiring mind, then software development may be the profession for you. Special Features: Dedicated software development laboratory for 3rd and 4th year Carlow students sponsored by UNUM. SETU Carlow’s final year industry showcase is attended by leading IT employers. Active participation by students in national and international competitions. Carlow Software Development students were recently awarded 2nd place in FIWARE ‘Smart Society’ competition in Seville, winning €40,000 in prize money for their ‘My people Care’ project. SETU Carlow maintains widespread collaborations with international third-level institution computing departments and has active research links with the Netherlands, France, China, Norway, Hungary and the UK. The computing department in Carlow continues to collaborate with many industry leaders in computing. For example Intel sponsored the use of the Galileo development board and Quark chip at the University and this leading edge technology was incorporated into several undergraduate and graduate research projects at SETU Carlow. Exit Awards: Higher Certificate in Computing (NFQ Level 6) after Year two and a Bachelor of Science in Software Development (NFQ Level 7) after Year three."},
{"institution": "Maynooth University", "level": "Undergrad", "course_title": "BSc in Mathematics and Computer Science (with Education)", "description": "If you are interested in a career as a second-level Mathematics and Computer Science teacher, this may be the degree for you. You will study with the Maynooth University Department of Education who are committed to reflecting on and interrogating the purposes, principles and values underpinning educational policy, practice and theory. You will take a five year route to second-level teaching instead of a six-year route. Why choose this degree? As an undergraduate, you will study a four-year Science degree, while also completing 60 credits in Education. After four years you are awarded a BSc Mathematics and Computer Science (with Education) degree  a level 8 honours degree. You now have two pathways open to you: You can choose to exit your studies with your level 8 qualification and take a different path in your education or career. You can continue with your studies to become a fully qualified teacher. This means you complete one further year of study at postgraduate level - required in order to meet the Teaching Council requirements to be registered as a Newly Qualified Teacher (NQT) in two subjects. Having graduated with your Level 8 BSc Mathematics and Computer Science (with Education) degree, you are guaranteed your place in this postgraduate year. At the end of year five of your studies, you will be a fully qualified second-level computer science and mathematics teacher up to Leaving Certificate level. Through this pathway you are fully qualified after five years rather than taking the six year route (details of the six-year route are outlined in the next bullet point above). For those students who may not achieve the points necessary to secure a place on MH212, an alternative, six-year route to second-level teaching is available. You can take the BSc Bachelor of Science (MH201) degree for four years and then apply for the Level 9 Professional Master of Education degree. The PME is a two-year, full-time programme designed to qualify graduates to teach at second level. Entry to the PME is competitive and is not guaranteed to graduates of the BSc Bachelor of Science degree. http://apps.maynoothuniversity.ie/courses/?TARGET=QUALIFICATION&MODE=VIEW&SUBJECT_CODE=&OFFERING_CODE=U_HONS_DEGREES&QUALIFICATION_CODE=CSEDP For more details on the course structure click here"},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "Bachelor of Science (Honours) Computer Games Development", "description": "What is the Course about? Games Development is one of the most exciting and dynamic areas of software development that one can work in. Graduates of this course are sought after by both multinational and indigenous industry leaders such as Microsoft, Black Shamrock, Glu Mobile and Dice Studios. The games industry continues to grow rapidly and Ireland is gaining international recognition as a centre of excellence due to the calibre of graduates in this field. Course Structure This course provides students with the skills they need to become professional games developers. Students will acquire skills in software design and programming, game design, graphics programming, and artificial intelligence. On completion, students will have produced several complete game concepts in a playable form. Lectures and course practicals cover game industry development technologies, including: programming languages (C++, C#, Javascript, Python and HTML5) game engine and frameworks (Unity 3D, Unreal Engine, SFML, SDL, OpenGL) and source code control systems (Git/Github). Students have the opportunity to make their own technology selection for the final year project. Collaboration is actively encouraged throughout this course. Collaboration, beginning in first year, with students from Interactive Digital Art and Design will result in the creation of numerous portfolio titles, game projects and technical demonstrations. Is this course for you? Have you a deep interest in how things work? Have you the persistence to see a task through to completion? Are you creative and proud of your work, willing to go the extra mile to get it just right? Have you a passion for learning new things? You are not just a consumer of content but also a creator. Special Features: An active learning environment that includes dedicated game development studios. Games Development students have competed successfully in national and international digital game events including: 2023 Games Fleadh Winners of six awards including Best Game built using Software libraries 2022 Games Fleadh: Robocode winners and winner of 3 special prizes including Best in Game Play. 2019 Games Fleadh: Game Studio Ireland Challenge. College Cup Champions and winners of four other awards. GameCraft 2019: Recipient of first, second and third prize. SETU Carlow’s final year project showcase is attended by leading employers in the games and IT industries. The department maintains an international perspective through widespread collaboration with other computing departments and higher education providers with active research links with Netherlands, France, China, Finland, Norway, Hungary and UK. Graduates of this course are sought after by employers and Institute of Technology Carlow alumni are working for prominent companies such as Frostbite Studios, Aeria Games, Glu Mobile, Havok, Demonware, Engage XR and Microsoft. Exit Award: Higher Certificate in Computer Games Design and Programming (NFQ Level 6) after Year 2 and Bachelor of Science in Computer Games Programming (NFQ Level 7) after Year 3."},
{"institution": "Maynooth University", "level": "Undergrad", "course_title": "BSc in Computational Thinking", "description": "Study Computer Science, Mathematics and Philosophy in an accelerated three-year Bachelor of Science degree. Learn how to combine human creativity with the power of computers to solve problems. Examine the essentials of theoretical computer science and their mathematical foundations. You will have the option of undertaking a 1-year work placement or study abroad between 2nd and 3rd year (subject to availability). Why choose this degree? Acquire hands-on programming skills, advanced problem-solving techniques, and learning to think logically and analytically when approaching complex problems developing your creativity and communication skills. Study Philosophy (seeking to understand and analyse human knowledge and thinking) and Advanced Mathematics. The Department of Computer Science at Maynooth University was founded in 1987 and is located in the Eolas Building, a 20M state-of-the-art ICT hub. Our laboratories and equipment provide excellent facilities for practical work and all our courses include a mix of lectures and lab work. http://apps.maynoothuniversity.ie/courses/?TARGET=QUALIFICATION&MODE=VIEW&SUBJECT_CODE=&OFFERING_CODE=U_HONS_DEGREES&QUALIFICATION_CODE=COMPT For more details on the course structure click here"},
{"institution": "Maynooth University", "level": "Undergrad", "course_title": "BSc in Multimedia, Mobile, and Web Development", "description": ""},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "Bachelor of Science Information Technology Management", "description": "What is the Course about? IT (Information Technology) Management involves the coordination of complex computer systems in organisations including the selection, installation and maintenance of all computing technologies. This is a critical role in any organisation as the efficient management of IT is vitally important for all aspects of a business. Course Structure This course provides a unique blend of business and IT subjects which is viewed by industry as an essential element in the role of a modern IT manager. The course comprises a significant amount of practical work. In particular, Year 1 features continuous assessments with no final year exam, enabling students to monitor progress throughout the year. On completion of the course, students will have a detailed understanding of: Network systems management, advanced database management Strategic management Team work and people management skills Financial information management Day-to-day IT department management. Is this course for you? Are you interested in working as an IT professional, but not necessarily as a software developer? Are you interested in a qualification that enables you to work in a vast array of organisations from small local companies to large multinationals? Are you interested in a course that gives you exposure to business and IT subjects much needed in industry? Special Features: Work placements are offered as part of all undergraduate courses with leading national and international companies. Previous placements have been made with Adidas (Germany), Ericsson, Kerry Food, MSD, Intel, Glanbia and Abbott Ireland. Exit award: Higher Certificate in Science in Computing (with options in Computer Applications and Programming) (NFQ Level 6) after Year 2."},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "Bachelor of Science (Honours) Information Technology Management", "description": "What is the Course about? IT (Information Technology) Management involves the coordination of complex computer systems in organisations including the selection, installation and maintenance of all computing technologies. This is a critical role in any organisation as the efficient management of IT is vitally important for all aspects of a business. Course Structure This course provides a unique blend of business and IT subjects which is viewed by industry as an essential element in the role of a modern IT manager. The course comprises a significant amount of practical work. In particular, Year 1 features continuous assessments with no final year exam, enabling students to monitor progress throughout the year. On completion of the course, students will have a detailed understanding of: Network systems management, advanced database management Strategic management Team work and people management skills Financial information management Day-to-day IT department management. Is this course for you? Are you interested in working as an IT professional, but not necessarily as a software developer? Are you interested in a qualification that enables you to work in a vast array of organisations from small local companies to large multinationals? Are you interested in a course that gives you exposure to business and IT subjects much needed in industry? Special Features: Work placements are offered as part of all undergraduate courses with leading national and international companies. Previous placements have been made with Adidas (Germany), Ericsson, Kerry Food, MSD, Intel, Glanbia and Abbott Ireland. SETU Carlow’s final year industry showcase is attended by leading IT employers. Exit awards: Higher Certificate in Computing (NFQ 6) after Year 2 and a Bachelor of Science in Information Technology Management (NFQ Level 7) after Year 3."},
{"institution": "Maynooth University", "level": "Undergrad", "course_title": "BSc in Computer Science and Software Engineering", "description": "Study all the principles and uses of computers and software, as well as key areas in mathematics, a major project and a six month placement in industry. Acquire hands-on programming skills and advanced problem solving techniques in our dedicated computer science building (Eolas). You will study another Arts subject or Critical Skills with Computer Science and Mathematics in 1st year. There is a transfer pathway from 1st year MH101 Arts to 2nd year MH601 CSA Computer Science and Software Engineering (through Arts). Students must have taken and passed at least 22.5 credits of Computer Science in 1st year (see Course Structure for details). There is no limit on places. Why choose this degree? Students enjoy the huge benefit of studying another Arts subject with Computer Science in 1st year. This lends graduates a wider frame of reference. The Department of Computer Science at Maynooth University was founded in 1987 and is located in the Eolas Building, a 20M state-of-the-art ICT hub. Our laboratories and equipment provide excellent facilities for practical work and all our courses include a mix of lectures and laboratory work. Spending time working in industry as part of your degree enhances your employment opportunities once you graduate. We endeavour to provide a supportive and enjoyable atmosphere for learning through our Computer Science Support Centre, extensive assistance during practical work and we are always available outside of lectures to help our students. http://apps.maynoothuniversity.ie/courses/?TARGET=QUALIFICATION&MODE=VIEW&SUBJECT_CODE=&OFFERING_CODE=U_HONS_DEGREES&QUALIFICATION_CODE=CSEA For more details on the course structure click here"},
{"institution": "Munster Technological University - Kerry Campus", "level": "Undergrad", "course_title": "[Level 7] Bachelor of Science in Computer Systems and Networking", "description": ""},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "NEW Bachelor of Science Computing in Interactive Digital Art and Design", "description": "What is the Course about? Graduates of Interactive Digital Art and Design are imaginative, innovative creators. They will make key contributions to digital product design, particularly when it comes to user experience. This field covers a range of industries, including games development, application development, multimedia entertainment, simulation and virtual reality creation, animation, and filmmaking. This program gives graduates the know-how for success in digital artistry and application development. They will learn concept design, digital artwork production and graphics coding. When done, they will have multiple concepts for games, applications, and media entertainment. Course Structure This course provides graduates with the skills required to become professional digital artists and application developers. They will acquire skills in concept design, art production and graphics programming. On completion, you will have produced numerous concepts for games, applications, and entertainment media. Lectures and course practicals cover industry-standard tools and technologies for: Digital Art Digital design Programming 2D Concept Art Graphic Design Application Development 3D Modelling and Sculpting User Interface Design Web Development HTML5 (Javascript, HTML, Css) Character Rigging Digital Product Prototyping 2D Animation Application Architectures Digital Media Production Collaboration is actively encouraged throughout this course and prepares students for the professional working environment. Collaboration, beginning in first year, with students from Computer Games Development will result in the creation of numerous portfolio titles, game projects and technical demonstrations Is this course for you? Are you interested in learning the principles of Digital Art production Are you interested in creating Interactive Digital Art for applications, games, film and media Are you interested in exploring the world of Applied Design in technology and entertainment industries Are you interested in Interactive Digital Art and simplifying complex interfaces to enable audience immersion Special Features: Students will develop their skills in a collaborative environment emphasised by teamwork and project work throughout the course. Access to state-of-the-art studio with individual student workstations for 3 rd year students Work placements incorporated into Year 3 and are offered with leading national and international companies; students may also opt to complete a portfolio project and / or a study abroad (Erasmus+) The department maintains an international perspective through widespread collaboration with other computing departments and higher education providers with active research links with Germany, The Netherlands, France, China, Finland, Norway, Hungary and UK. Exit Award: Bachelor of Science in Computing in Interactive Digital Art and Design (NFQ Level 6) after Year 2"},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "Bachelor of Science in Cybercrime and IT Security", "description": "What is the Course about? IT Security is the practice of safeguarding information from unauthorised access and modification. Cybercrime is illegal activity carried out with technology. With growing dependence on technology and increased interconnectivity between personal, business, government devices and critical infrastructure, the requirement for security in the IT ecosystem is amplified. This course aims to provide industry with graduates who are knowledgeable in cybersecurity processes, practices, implementation and assessment of both IT infrastructure and software, enabling secure and scalable solutions. Course Structure The course structure incorporates three knowledge pillars: software development, networking and cybersecurity. Initially the learners obtain the skills in the design and build of computer networks and software applications. The security modules enable the learners to assess the security risk and posture of digital environments and perform remediation on identified security vulnerabilities. Is this course for you? Are you the type of person who enjoys taking things apart to see how they work? Are you interested in understanding and probing what is really taking place behind any digital media? Have you the attention and determination to complete challenges to the best of your ability? Special Features: Students will be following our “learning by doing” model in first year with continuous assessment replacing final exams. Work placement is incorporated into Year 3 of the course. Exit Award: Higher Certificate in Science in Computing and Risk Management (NFQ Level 6) after Year 2."},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "NEW Bachelor of Science (Honours) Computing in Interactive Digital Art and Design", "description": "What is the Course about? Graduates of Interactive Digital Art and Design are imaginative, innovative creators. They will make key contributions to digital product design, particularly when it comes to user experience. This field covers a range of industries, including games development, application development, multimedia entertainment, simulation and virtual reality creation, animation, and filmmaking. This program gives graduates the know-how for success in digital artistry and application development. They will learn concept design, digital artwork production and graphics coding. When done, they will have multiple concepts for games, applications, and media entertainment. Course Structure This course provides graduates with the skills required to become a professional digital artist and application developer. They will acquire skills in concept design, art production and graphics programming. On completion, you will have produced numerous concepts for games, applications and entertainment media. Lectures and course practicals cover industry-standard tools and technologies for: Digital Art Digital Design Programming 2D Concept Art Graphic Design Application Development 3D Modelling and Sculpting User Interface Design Web Development Texture Painting Digital Product Prototyping VFX Production Pipeline Character Rigging Application Architectures VFX Programming 2D and 3D Animation 3D Printing and Rapid Prototyping VFX Rendering Digital Media Production Collaboration is actively encouraged throughout this course and prepares students for the professional working environment. Collaboration, beginning in first year, with students from Computer Games Development will result in the creation of numerous portfolio titles, game projects and technical demonstrations. Is this course for you? Are you interested in learning the principles of Digital Art production Are you interested in creating Interactive Digital Art for applications, games, film and media Are you interested in exploring the world of Applied Design in technology and entertainment industries Are you interested in Interactive Digital Art and simplifying complex interfaces to enable audience immersion Special Features: Students will develop their skills in a collaborative environment emphasised by teamwork and project work throughout the course. Access to state-of-the-art studio with individual student workstations for 3 rd and 4th year students Work placements incorporated into Year 3 and are offered with leading national and international companies; students may also opt to complete a portfolio project and / or a study abroad (Erasmus+) The department maintains an international perspective through widespread collaboration with other computing departments and higher education providers with active research links with Germany, The Netherlands, France, China, Finland, Norway, Hungary and UK. Exit Award: Bachelor of Science in Computing in Interactive Digital Art and Design (NFQ Level 7) after Year 3. SETU Carlow's final year project showcase is attended by leading employers in creative industries."},
{"institution": "Institute of Technology Carlow", "level": "Undergrad", "course_title": "Bachelor of Science (Honours) in Cybercrime and IT Security", "description": "What is the Course about? IT Security is the practice of safeguarding information from unauthorised access and modification. Cybercrime is illegal activity carried out with technology. With growing dependence on technology and increased interconnectivity between personal, business, government devices and critical infrastructure, the requirement for security in the IT ecosystem is amplified. This course aims to provide industry with graduates who are knowledgeable in cybersecurity processes, practices, implementation and assessment of both IT infrastructure and software, enabling secure and scalable solutions. Course Structure The course structure incorporates three knowledge pillars: software development, networking and cybersecurity. Initially the learners obtain the skills in the design and build of computer networks and software applications. The security modules enable the learners to assess the security risk and posture of digital environments and perform remediation on identified security vulnerabilities. Is this course for you? Are you the type of person who enjoys taking things apart to see how they work? Are you interested in understanding and probing what is really taking place behind any digital media? Have you the attention and determination to complete challenges to the best of your ability? Special Features: Students will be following our “learning by doing” model in first year with continuous assessment replacing final exams. Work placement is incorporated into Year 3 of the course. Final Year students will have the opportunity to display their skills and project work at the SETU Carlow industry showcase which is attended by leading IT employers. Exit Award: Higher Certificate in Science in Computing and Risk Management (NFQ Level 6) after Year 2 and Bachelor of Science in Cybercrime and IT Security (NFQ Level 7) after Year 3."},
{"institution": "University College Cork", "level": "Undergrad", "course_title": "BA Psychology and Computing", "description": ""},
{"institution": "University College Cork", "level": "Undergrad", "course_title": "BSc Data Science & Analytics", "description": ""},
{"institution": "NUI Galway", "level": "Postgrad", "course_title": "M.Sc. Software Design & Development", "description": "This two-year MSc is aimed at candidates with little or no IT experience who want to pursue a career in the IT industry. The skills developed in this programme include the core software development tools and techniques as well as a solid grounding in research and its application in a specific ICT (information and communications technology) domain. Students can exit this programme after Year One with a Higher Diploma (1SD1). This course is aimed at students who have already obtained a Level 8 postgraduate qualification in IT and are interested in pursuing an MSc qualification. As a distance-learning programme, it suits candidates who are in full-time employment and/or living abroad. The programme is in line with the University Policy for Recognition of Prior Learning in that it recognises prior academic qualifications. The aim of this initiative is to provide graduates with the opportunity to acquire qualifications for employment in the ICT area. This programme is aimed at candidates with little or no IT experience. It provides an academic foundation and broad technical training in software design and development. The skills developed in this programme include the core software development tools and techniques as well as a solid grounding in a specific ICT (information and communications technology) domain. Find out about our Postgraduate Scholarships https://www.nuigalway.ie/postgraduate_scholarships/ https://www.universityofgalway.ie/science-engineering/school-of-computer-science/programmes/postgraduate-courses/ https://www.universityofgalway.ie/science-engineering/school-of-computer-science/programmes/postgraduate-courses/ Applications are made online via the University of Galway https://nuigalway.elluciancrmrecruit.com/Apply/Account/Login . Semester One exams: December. Semester Two exams: April/May— A range of assessment methods are integrated and applied throughout the programme. These include essays, projects, reports, presentations and case studies. Year Two culminates with the submission of a dissertation— : while students have to pass the qualifier module before they can continue with their research, the overall assessment is solely based on their submitted dissertation."},
{"institution": "University College Cork", "level": "Undergrad", "course_title": "BSc Computer Science(Hons)", "description": ""},
{"institution": "Institute of Technology Sligo", "level": "Undergrad", "course_title": "Computer Networks and Cloud Infrastructure", "description": "The BSc in Computer Networks and Cloud Infrastructure will provide the learner with the skills, knowledge, and competencies required to begin a career in Information Technology/Computer Networking. The programme enables the learner to work with computer networks and cloud infrastructure in order to design, analyse, survey, configure, install, monitor, secure, evaluate, and troubleshoot network, server and telecommunications configurations. This programme is mapped onto professional industry qualifications, and helps to prepare candidates for immediate employment using skills gained in the required areas."},
{"institution": "NUI Galway", "level": "Postgrad", "course_title": "MSc Computer Science (Data Analytics)", "description": "Almost everything we do results in data being created and stored somewhere. Individuals, communities, business and governments face major challenges in harnessing all this data to create knowledge that will underpin a healthier, safer, more productive world. There is an acute global shortage of talent and expertise in Data Analytics and Data Science. Due to the strong demand for these graduates and the leading edge quality of this particular programme, annual demand for places on the programme is extremely competitive. This is an advanced MSc programme that is delivered full-time over one year, and provides graduates of Computer Science and closely related areas with in-depth knowledge and skills in the emerging growth area of Data Analytics and Data Science. The MSc in Data Analytics is delivered by a team of highly respected academics based in University of Galway that are considered international experts in their respective fields. Some of the topic areas include large-scale data analytics, advanced data-mining and machine learning, deep learning, information retrieval, natural language processing, data visualisation, web mining, linked-data analytics, simulation and modelling, and digital image processing. This programme is aimed at graduates with a primary qualification in Computer Science or related subject area. It is not a conversion course, and students are expected to be already at a very high technical standard with regard to the technical elements of their computing background. In addition to completing a range of advanced modules, students will then reinforce their newly gained skills through a 30-credit project that is completed during the summer and evaluated through a thesis (minor dissertation) format. For these projects, students work directly with an academic supervisor in their chosen area of specialisation, while they also can pursue the opportunity to collaborate with a research groups across University of Galway or with an industry partner. University of Galway, School of Computer Science is offering one scholarship for the MSc in Computer Science (Artificial Intelligence, Data Analytics) commencing September 2023; this scholarship, up to the full value of the EU tuition fee is awarded to the highest ranked graduate of the BSc Computer Science & IT undergraduate programme (GY350) among those who apply for the scholarship. This is open to all current GY350 final year students due to graduate in 2023, and all previous graduates of the programme. Find out about our Postgraduate Scholarships https://www.nuigalway.ie/postgraduate_scholarships/ You may also be interested in one of our other https://www.universityofgalway.ie/science-engineering/school-of-computer-science/programmes/postgraduate-courses/ postgraduate programmes. Applications are made online via the University of Galway https://nuigalway.elluciancrmrecruit.com/Apply/Account/Login . What is not required (please do not submit these)"},
{"institution": "NUI Galway", "level": "Undergrad", "course_title": "Higher Diploma Applied Science (Software Design and Development)", "description": ""},
{"institution": "Institute of Technology Sligo", "level": "Undergrad", "course_title": "Web Development and Creative Media", "description": ""},
{"institution": "Institute of Technology Sligo", "level": "Undergrad", "course_title": "Games Development", "description": "Games development is now a massive multi-million Euro global industry. Xbox, PlayStation and Smartphone Apps are some examples but there are countless other businesses working on games and applications development. This degree uses a software engineering approach to games development, combining study of the technical aspects of games programming, including virtual reality, augmented reality and artiﬁcial intelligence, with the principles of project management, quality assurance and organisational management. While focused on developing games software, we also provide a general grounding in software engineering to equip students with the breadth of skills to work in any aspect of the information technology industry. A cutting edge games development computer laboratory and peripheral hardware are just some of the features on this programme which allow students to flex their creativity and gain first-hand experience. A common first year across computing programmes allows students and lecturers alike to establish where each student’s strengths lie. Games development students diverge from the common year to get access to the Introduction to Games Programming module, designed specifically to prepare them for future games programming subjects. There are modules in both 2D and 3D Games Programming, Object Oriented Programming and Game Content Design. Students will be introduced to Database Technology, Data Structures and Algorithms. In Year 3 students have the space and support to work in a team, to design and develop an original gaming experience, while exploring emerging technologies such as augmented and virtual reality. The emphasis is on preparing the student for the workplace through work placement. Our network of employers welcomes this course and a successful work placement is often the door to a full-time job. Work commenced in October 2021 on a new innovative gaming hub in Sligo. The €1.9m development will provide a flexible workspace for companies working in the digital gaming sector. The hub will help entrepreneurs start and scale innovative gaming businesses and further enhance the northwest’s reputation for tech. It will be constructed next to the existing Strand Campus Enterprise Hub, which serves tech and digital companies with meeting spaces, mail drop and hot-desking facilities. The hub will have capacity for 20 different companies and support a further 40 companies through the establishment of a digital games cluster in the northwest. There are several distinct features to this programme: - All our Computing degrees have a common first year. Students study a wide range of computing modules to give them an understanding of all aspects of computing and the flexibility to change direction in Year 2 if desired. Students can choose from https://www.itsligo.ie/courses/bsc-computing-undenominated/ , https://www.itsligo.ie/courses/bsc-computer-networks-cloud-infrastructure/ , https://www.itsligo.ie/courses/bsc-in-computing-in-software-development/ or https://www.itsligo.ie/courses/bsc-in-computing-in-games-development/ - We believe students learn best by doing and our programme is built upon hands on lab work. - We have invested heavily in equipment, computer labs and workspaces to ensure students have the best tools to learn and prepare them for the workplace. New high-tech computer teaching labs will open at ATU Sligo in 2023 and give students access to the latest advancements in technology. Substantial projects enable students to really grapple with a problem and create a killer solution. In Year 3 students have the space and support to work in a team year-long towards a solution that will wow employers. - We have been offering placement longer than most and we’re good at it. Our network of employers welcome this programme and a successful work placement is often the door to a full-time job."},
{"institution": "Technological University Dublin - Blanchardstown Campus", "level": "Undergrad", "course_title": "Bachelor of Science(Honours) in Computing in Digital Forensics and Cyber Security", "description": "Do you question accepted approaches to cyber security, or wonder how a network intruder or hacker behaves? This course will provide you with an all-round perspective on information security risk and risk management. It is designed to produce highly knowledgeable and skilled graduates to counter the growing cyber security threat facing the world today. Graduates are in high demand in all parts of the Information Technology sector, as security is one of the fastest-growing parts of the industry. Subjects covered range from the basics of Programming, Networking, Web Development and Databases to Advanced Programming, IT Business Management, Penetration Testing, Secure Programming, and Network Security. In your final year, you will cover advanced topics such as Mobile Device Forensics, Biometrics and Forensics Applications, Application Security, as well as undertaking a project which will feature in our annual graduate showcase. As well as hands on labs and lectures, students on this course will have the opportunity to take part in regular Capture-the Flag competitions and field trips. Visiting industry specialists help students to develop cutting edge skills by engaging on a range of real world cyber security challenges. Outside of the classroom, you might consider joining our HackerSoc, which offers a range of annual events and workshops. Alternatively, why not sign up for the qualifiers of the European Cyber Security Challenge. Each year the Irish team is packed with students from our courses aiming to compete with the world’s best in Cyber Security talent. During your studies, you will have access to state-of-the-art computing, networking and cyber-security labs. You’ll have easy online access to course materials, and on-site support from enthusiastic academic staff willing to share their expertise and knowledge with you. Our students frequently take up internships with some of the countries leading Cyber Security companies. As well as studying core knowledge, our modules build towards a number of industrial certifications like ACE, CISSP, Cisco Security, Security+ and Ethical Hacker so that students will be well placed to take some of these industry exams as a value-added extra to their final degree qualifications. A spec (i.e. able to run Win 10, an AV solution and Office comfortably. Be able to use Wi-fi and camera to attend online classes, use other software such as SPSS, Adobe Connect, Minitab, Maple, so needs more RAM, SSD, etc.) Please search for the TU Dublin offer on the HEA website You will find graduates from this course working in a range of industry leading roles including: Former graduates currently work in leading Cyber Security roles in companies such as;"},
{"institution": "Institute of Technology Sligo", "level": "Undergrad", "course_title": "Software Development", "description": "Ireland’s reputation as a centre of software excellence is unrivalled in Europe. It is home to over 900 software companies, including both multinational and indigenous firms, employing 24,000 people and generating €16 billion of exports annually. The Irish technology sector remains buoyant with Google, Facebook, Microsoft and eBay all having a major presence here. Our objective is to equip graduates with the skills to seek employment in this level of business. We constantly re-assess programme content to keep apace of emerging platforms and industry trends.This programme takes into account the specific requirements of the global software industry and what it expects from graduates. The emphasis on the programme is in supplying students with coding and communication skills to enable them to be productive members of a growing worldwide software technology sector. This is common across all computing streams. The emphasis is to introduce students to the variety of computing technologies including fundamentals of Computer Hardware, Micro Controller Programming, an Introduction to Microsoft .NET programming and Mathematics for Computing. Special supports are in place to aid with Mathematics for Computing. Planning and developing small object-oriented software solutions for desktop and the web in a cloud-based environment. Modules include: Systems Analysis and Design, Database Systems, Object Oriented Programming, Web Programming, Cloud Computing, Mathematics. A year-long group project, Work Placement, Rich Applications Development, Software Engineering, Database Management, and Open Stack Development. There are several distinct features to this programme: - All our Computing degrees have a common first year. Students study a wide range of computing modules to give them an understanding of all aspects of computing and the flexibility to change direction in Year 2 if desired. Students can choose from https://www.itsligo.ie/courses/bsc-computing-undenominated/ , https://www.itsligo.ie/courses/bsc-computer-networks-cloud-infrastructure/ , https://www.itsligo.ie/courses/bsc-in-computing-in-software-development/ or https://www.itsligo.ie/courses/bsc-in-computing-in-games-development/ - We believe students learn best by doing and our programme is built upon hands on lab work where students create software solutions. - We have invested heavily in equipment, computer labs and workspaces to ensure students have the best tools to learn and prepare them for the workplace. New high-tech computer teaching labs will open in 2023 and give students access to the latest advancements in technology. Substantial projects enable students to really grapple with a problem and create a killer solution. In Year 3 they have the space and support to work in a team year-long towards a solution that will wow employers. - We have been offering work placement longer than most and we’re good at it. Our network of employers welcome this programme and a successful work placement is often the door to a full-time job. So, choose this programme if: The sector’s traditional players with long-established operations – such as Intel, HP, IBM, Microsoft and Apple, have been joined by newer firms leading the way in the internet and social media revolution, including Google, Facebook, LinkedIn, Amazon, PayPal, eBay and Twitter. Their arrival has firmly positioned Ireland as the internet capital of Europe. Ireland is the also the European data centre location of choice for world leaders including IBM, Microsoft, Google, Yahoo, MSN and Adobe and is poised to become a global cloud centre of excellence. The sector’s wide-ranging activities include Software Development, R&D, Business Services and EMEA/International headquarters."},
{"institution": "Technological University Dublin - Blanchardstown Campus", "level": "Undergrad", "course_title": "Bachelor of Science (Honours) in Computing", "description": "Combining the best of computer science with hands on practical skills, this four year degree will see students gain skills, knowledge and competencies in software development, mobile application development, web development, game and interactive development, entrepreneurship, networking, and cyber-security. In your final year, you’ll specialise in an area such as software design, mobile development, human language technology, data science, high performance computing, game development, cloud computing and more. Our annual display of final-year student work allows students to showcase their creative and technical talents to a range of industry employers and business groups who are keen to secure the best graduate talent to meet the demands of the growing IT industry. During your studies, you will have access to state-of-the-art computing, networking and cyber-security labs. You’ll have easy online access to course materials, and on-site support from enthusiastic academic staff willing to share their expertise and knowledge with you. As part of the computing course, you can receive dual accreditation for industry-certified courses such as CompTIA, Cisco CCNA, Linux and Microsoft. A spec (i.e. able to run Win 10, an AV solution and Office comfortably. Be able to use Wi-fi and camera to attend online classes, use other software such as SPSS, Adobe Connect, Minitab, Maple, so needs more RAM, SSD, etc.) Please search for the TU Dublin offer on the HEA website Our graduates work in a rage of roles including: Graduate Employers:"},
{"institution": "NUI Galway", "level": "Undergrad", "course_title": "BSc in Computer Science and Information Technology", "description": "We depend on electronic devices, such as computers and mobile phones, computer software and networks to store, process, transmit, retrieve and manipulate information. Students will cover the technology used in these devices and will focus on the development of the software applications that make these devices useful. The programme has a flexible course structure, where students can choose to study a range of Next-Generation Technology areas including: Digital Media and Games, Enterprise Informatics, Energy Informatics, Computational Mathematics, Scientific Computing and Medical/ Bio-informatics. These core subjects provide a solid theoretical and applied background in Computer Science and Information Technology. As part of this four-year course, students will undertake an eight month (January - August) off-campus work placement in an industrial setting following completion of their thrid year of study. In the event that no external placement is available, students will be given projects on campus. This work experience programme gives students an opportunity to work on projects relevant to their study and significantly improves their chances of obtaining employment after graduation. Read more about Engineering https://www.nuigalway.ie/engineering-informatics/engineeringworkplacements/ All Degrees at NUI Galway are professionally accredited by the statutory professional body, Engineers Ireland. This “Accreditation” means that the degree has been assessed and approved to meet the educational requirements for professional Engineers. *A Chartered Engineer is the highest professional education standard in . A chartered Engineer is competent (because of their education and training) to assume personal responsibility for   the   development   and   application   of in research, design, construction, manufacturing, superintending, managing and  in  the education of the engineer. His/her work is predominantly intellectual and varied and not of a routine mental or physical character. It requires the  exercise  of  original  thought  and  judgement  and  the  ability  to supervise the technical and administrative work of others."},
{"institution": "Institute of Technology Sligo", "level": "Undergrad", "course_title": "Electronic and Computer Engineering", "description": "Modern electronic engineering systems are often referred to as embedded systems and these systems are the main focus of Electronic Engineering in ATU Sligo. Embedded Systems combine hardware (electronic circuits), software (computer programs) together into products such as mobile phones, MP3 Players, computer network routers, aircraft guidance systems and automobile engine management systems. This is year 3 (the award year) of the Level 7 BEng in Electronic Engineering. Having completed the programme, you will be able to:"},
{"institution": "NUI Galway", "level": "Certificate", "course_title": "Foundation Course in Science, Technology, and Engineering", "description": "This programme is designed for individuals who have been out of the formal education system for some time and now wish to begin third level studies in the areas of Science, Technology or Engineering. The preparatory nature of the programme builds up participants’ confidence in their academic ability and equips them with skills that will help them to participate in future third level education programmes in a technology related area. For more information, please visit the https://www.universityofgalway.ie/mature/part-time/ for further information. The course takes place over 26 weeks - Tuesdays and Thursdays (7-10pm) and one or two Saturdays per month (10am-5pm). Most modules on the programme are assessed through a combination of coursework and examination. For modules where coursework counts for less than 100% of marks, exams take place at the end of each module or semester."},
{"institution": "Technological University Dublin - Blanchardstown Campus", "level": "Certificate Learn and Work", "course_title": "Computing - Networking Technologies (Learn and Work)", "description": "Learn+Work course is a professional traineeship course providing a pipeline of skilled in-demand work-ready talent into STEM industries through industry partnership. This Learn+Work course is designed for trainee network technicians and engineers, and was developed in response to the industry’s growing need for people who can design, install, and maintain computer systems. This course will help you develop the knowledge and skills you need to avail of the numerous job opportunities in the ICT and Networking field. You’ll enjoy a mix of theory and practical learning, including sessions in our laboratories equipped with real-world equipment and software used in industry. You can also avail of the opportunity to gain Industry Certified Awards, including; A spec (i.e. able to run Win 10, an AV solution and Office comfortably. Be able to use Wi-fi and camera to attend online classes, use other software such as SPSS, Adobe Connect, Minitab, Maple, so needs more RAM, SSD, etc.) Please search for the TU Dublin offer on the HEA website Network Technician working in industries such as: Graduate Employers:"},
{"institution": "Technological University Dublin - Blanchardstown Campus", "level": "Certificate Part-Time", "course_title": "Computer Systems Management", "description": "Perfect for sociable, progressive, naturally curious types who enjoy the company of like-minded people, enjoy technical topics and love problem-solving, games and fun. The aim of this course is to produce computing graduates with the skills, knowledge and competencies in telecommunications and networks, software engineering , multimedia and cloud computing. This course is designed to produce graduates with the skills required to operate as a first line information technology support person in a wide range of industry and business environments. The course comprises both taught modules and credits for relevant work experience. Students will need access to a laptop. A MEDIUM spec (i.e. able to run Win 10, an AV solution and Office comfortably. Be able to use Wi-fi and camera to attend online classes, use other software such as SPSS, Adobe Connect, Minitab, Maple, so needs more RAM, SSD, etc.) Please search for the TU Dublin offer on the HEA website Computing graduates are some of the most sought after graduates in the Irish and global economics. Computing graduates occupy a dizzying array of roles in the computing industry."},
{"institution": "Technological University Dublin - Blanchardstown Campus", "level": "Certificate Part-Time", "course_title": "Certificate in CISCO-CCNA", "description": ""},
{"institution": "Technological University Dublin - Tallaght Campus", "level": "Undergrad", "course_title": "Electronic and Software Engineering", "description": "In a world where electrical and electronic engineering empowers the way we live, and is inextricably linked to almost everything we do, where does Electronic & Software Engineering fit? This video offers some context… Electronic Engineering involves the understanding of both hardware and software and how they combine within high technology systems from the design of nanotech devices to the operation of a high speed computer networks. Engineering Software involves the design and development of software systems and various forms of computer-based applications. Software Engineering is important due to the ever-increasing use of mobile technology, the increasing complexity of high technology solutions, and the emergence of new areas such as Internet of Things. Both courses allow the graduates pursue a wide range of engineering interests and career choices. You will use your imagination, creativity and knowledge to provide society with the complex electronic and software systems. A graduate in B.Eng in Electronic Engineering will be able to understand, assemble and test complex electronic systems and equipment; can assist a professional electronic engineer in refining product designs and ensure they work as efficiently as possible, and usually works with teams of other professionals to build and test products."},
{"institution": "Technological University Dublin - Tallaght Campus", "level": "Undergrad", "course_title": "Computing", "description": "Students enrolling in the Level 8 Computing program will have the opportunity in Year 1 to choose between two specializations - and These are well-established and highly regarded programs that have been offered in previous years. We know that students need to first gain an understanding of these areas before choosing a specialisation. The demand for computing professionals is at an all-time high, both in Ireland and worldwide, with an exponential growth in job opportunities, particularly in the fields of Software Development and Information Technology Management. Given the rapid advancements in technology across various industries, including healthcare, robotics, pharmaceuticals, automotive, and more, graduates from these computing programs will play a pivotal role in driving innovation and enhancing our quality of life through cutting-edge solutions. This Level 8 program spans four years and offers additional tutorials for students who may need extra academic support. Our computing disciplines take pride in producing graduates who are job-ready after completing the four-year program. Students will experience modern and innovative teaching methods in state-of-the-art laboratories and lectures. They also have the opportunity to visit technology companies, participate in international exchange programs with partner universities in countries such as France, Spain, Germany and Austria and gain valuable work experience through our strong connections with industry partners and alumni. Computing graduates are trained to think creatively, tackle complex problems, and develop new technologies. We have two streams available after completion of 1st Year:"},
{"institution": "University College Dublin", "level": "Postgrad", "course_title": "MSc in Forensic Computing and Cybercrime Investigation", "description": "This is a programme for law enforcement. It aims to provide high quality forensic computing and cybercrime investigation training and formal education. It is also designed to deliver cutting-edge, up-to-date cybercrime investigation techniques, strategies and tactics that allow students to understand and tackle emerging trends in cybercrime. Over the past 17 years, we have brought in specialists from around the world to review and advise on the content considering the needs of digital forensic investigators and computer crime specialists. The UCD School of Computer Science (CS) and UCD Centre for Cybersecurity and Cybercrime Investigation (CCI) is working closely with law enforcement agencies and industry practitioners in seeking solutions to technologies-related crime. CS and CCI staff also collaborate with the scientists from European Cybercrime Training and Educational Group at Europol (ECTEG). Lectures are pre-recorded and provided online via a virtual online learning environment. Exercises, reading, assignments and projects are conducted online and in our virtual labs. Students are required to come to Dublin or another UCD exam centre each year to complete in-person examinations. All modules are examined in May each year in Dublin, Netherlands, Canada and the USA. We also hold optional exams in Dublin and the Netherlands in December for our semester one modules. https://www.ucd.ie/science/t4media/ucdscience_grad_courses.pdf (pdf) A wide range of modules is available at beginner and advanced levels. On successful completion of the programme, depending on the module taken, students will be able to: For law enforcement officers, having this qualification has the additional advantage of adding credibility to their testimony as expert witnesses. Career development possibilities in this field are excellent. Graduates include senior staff at Europol and INTERPOL, members of national and regional police forces and police training colleges, government ministries and agencies with Law Enforcement (LE) powers, defence forces, specialist cybercrime agencies, revenue, customs and border protection. Full Time option suitable for: Domestic(EEA) applicants: International (Non EEA) applicants currently http://www.inis.gov.ie/en/INIS/Pages/I%20want%20to%20study%20a%20degree%20programme%20course outside of the EEA Region. Part Time option suitable for: Domestic(EEA) applicants: International (Non EEA) applicants currently http://www.inis.gov.ie/en/INIS/Pages/I%20want%20to%20study%20a%20degree%20programme%20course outside of the EEA Region. This programme is open to members of LAW ENFORCEMENT AGENCIES ONLY with a minimum of 5 years Law enforcement experience. This includes employees of any organisation that has responsibility for the enforcement of national or local legislation including but not limited to: Police Forces, International law enforcement organisations (Europol, Interpol, etc), Fisheries, Border control, Immigration, Tax/Revenue & Customs, Regulatory enforcement, Military (Army, Navy, Air Force etc). The programme is flexible enough to accomodate both experts and beginners in the field of digital forensics and cybercrime investigation. This is a programme for law enforcement. This programme aims to provide high quality forensic computing and cybercrime investigation training and formal education. It is also designed to deliver cutting-edge, up-to-date cybercrime investigation techniques, strategies and tactics that allow students to understand and tackle emerging trends in cybercrime. (Purposes). Over the past 12 years we have brought in specialists from around the world to review and advise on the content considering the needs of digital forensic investigators and computer crime specialists. The UCD School of Computer Science (CS) and UCD Centre for Cybersecurity and Cybercrime Investigation (CCI) have been working closely with law enforcement agencies and industry practitioners in seeking solutions to technologies-related crime. CS and CCI staff also collaborate with the scientists from European Cybercrime Training and Educational Group at Europol (ECTEG) to work on applied research and developing forensic tools and then transfer both high impact research achievement and efficient, free forensic tools to the students. This programme is delivered by not only the experienced academia staff from CS and CCI but also the experts who are leaders, managers, heads of forensic department in law enforcement agencies and industries. Besides, with a modular structure and part-time options, students can combine study with full-time work and family commitments. (Values). The programme structure fosters and encourages close liaison between students, so graduates leave not only having required skills for all cybercrime investigating services but also an excellent international network of contacts for the future. (Learning outcomes). All lectures are pre-recorded and provided online via a virtual online learning environment, allowing students to participate from their house or office. All modules consist of continuous formative assessment components assessing core practical skills and culminate in a written summative assessment final exam. Students attend UCD exam centres only for examinations each year. Students will graduate with a UCD MSc when (s)he has achieved 90 credits. (Approaches to teaching learning and assessment).. ./!W_HU_MENU.P_PUBLISH?p_tag=MODULES&MAJR=T146 Course content and the flexible mode of delivery are designed to suit busy working professionals located all over the world. There are two core modules and a further fifteen elective taught modules. Masters students are recommended to take the core modules and then select further modules, according to their interests and experience. Please look at the detailed module descriptions for pre-requisites, learning outcomes, assessment scheme and workload.  It is not mandatory to do a dissertation - the MSc may be completed with taught modules only. Most students follow the part-time MSc (T025) over 2 years. Graduate Diploma (T007) and Graduate Certificate (F007) options are also available. It is possible to take single modules as CPD (F001) Lectures are pre-recorded and provided online via a virtual online learning environment. Exercises, reading and assignments and projects are conducted online and in our virtual labs. Students are required to come to Dublin or another UCD exam centre each year to complete in-person examinations and workshops. All modules are examined in May each year in Dublin, Netherlands, Canada and the USA. We also hold optional exams in Dublin and the Netherlands in December for our semester one modules. MSc Forensic Computing and Cybercrime Investigation (T025) Part Time EU/NONEU    fee per year - € 5544 MSc Forensic Computing and Cybercrime Investigation (T146) Full Time EU           fee per year - € 11088 nonEU    fee per year - € 10994 Tuition fee information is available on the http://www.ucd.ie/fees .  The cost of examination trips is included in the tuition fee and students are expected to support themselves while attending examinations and other events. Tuition fees are the same for EU and non-EU students.. All applicants must be current employees of a law enforcement organisation (LE) working in an investigative role. You do not have to be a sworn officer. LE includes any organisation that has responsibility for the enforcement of national or local legislation such as: We prefer applicants with a primary degree in computer science. However if you do not have this, but you have been working in the field of digital forensic investigations in law enforcement for more than 2 years and you have successfully completed advanced training, then we will consider this in compensation, at the discretion of the course directors. In such cases we may ask you to take 3 single modules as CPD (Continual Professional Development) and if you achieve grades of B- or higher you may be allowed to transfer to the MSc programme. Please note that in some countries, a Masters degree is not recognised unless you also have an undergraduate degree and do a major piece of research as part of your Masters. Each applicant will be assessed on a case by case basis. Students are also required to fulfil UCD’s English Language Requirements (see http://www.ucd.ie/international/study-at-ucd-global/ucdenglishlanguagerequirements/ ) \"Studying in UCD has been a lifetime experience for me. The skills in law enforcement and digital forensic that I have acquired and enhanced, will go a long way in improving my professional skills. The course has been hands-on and I am confident that I am well placed for most challenges in the future that touch on Law Enforcement, Digital Forensics Investigation and Cybercrime.\" “I graduated while serving as a Criminal Intelligence officer in the Crimes against Children team at INTERPOL. I subsequently went on to become the Assistant Director with responsibility for the Vulnerable communities group which included the Crimes against Children, Human Trafficking and People Smuggling teams. I have no doubt that my masters from UCD assisted in making me a successful candidate for that executive team role and built on other qualifications I already had including a BA (IT) and a diploma in project management. I have also been privileged to be associated with the development of the Masters programme from the very start and building the Online Child Abuse module which I still teach today.  It's a great masters and I highly recommend it to my fellow LEO all around the world.  The team at UCD are very professional and hard working to ensure you have a successful time there and you meet other students from all around the world, forming friendships and bonds that are very helpful in your professional and personal life.” “I originally selected the program as the modules provided very practical application to my current job functions so it made it possible to learn new things that have a direct application to my field. I like the distance learning format as well as the fact that I was able to use several of the things I learned in my current job. I was able to learn different areas of cyber crime investigations that I had not otherwise been exposed to which will certainly help in my current assignment as well as opening up new possibilities in the future.  The exposure to those disciplines has sparked an interest and given me a great foundation on which to build to be more effective in my current position as well as the potential for future opportunities.” “As a direct result of completing the MSc - I was head hunted by 2 Digital Forensics Companies - Cellebrite and MSAB. I decided MSAB was the more exciting opportunity, and I became their Global Project Manager, so not only was it great completing the MSc, it directly led to a new, exciting - and well paid job - a huge thanks to you all.” Jacques was National Manager for Canada Revenue Agency’s computer forensics program before his new job with UNICEF as a computer forensic examiner supporting a team of internal investigators. Jacques says the MSc was a factor in getting this new job. \"Having both the Master's and almost 30 years investigations pushed me ahead of other candidates.\" “The knowledge and experience I gained during the study is still helpful in my daily work. For two years now I have been coordinator of the cybercrime and digital investigation team of the police academy of The Netherlands. The Masters has helped me to establish a big international network which I continue to make use of and expand. This has helped in developing and sharing new knowledge between different countries and cooperating together. UCD was a great platform to start this and still is through the alumni network.\" \"The MSc programme opened so many doors, some I can talk about, others were used as part of investigations in Organised Crime!\" “The UCD MSc enabled me to grow in my career path and 4 years after graduation I switched career from law enforcement to the financial industry where I established a cyber defence centre for a global bank. For the past year I have been head of global security assessments services which includes red teaming.” Whilst studying for the MSc, Damien was in the Military Police where he says “the course really came into its own, allowing me to deliver enhanced in-house cyber investigation training to our Military Police investigators. The MSc not only provided a solid technical foundation for cyber investigations and cyber centric forensic analysis but also the friendships created during the course have stood the test of time. From a professional perspective the ability to access a broad range of technical experts and cyber investigators from across Europe has paid dividends on many occasions and was most beneficial while working abroad with the EU. The professional credibility of the MSc has greatly enhanced the quality of investigations and evidence gathered as a result of computer Forensic Analysis. The course was an excellent addition to my own skill set and the qualification of MSc underpinned the quality and credibility of associated investigations.” As well as UCD faculty, lecturers for this programme include subject experts from industry and law enforcement. The following entry routes are available: * Courses will remain open until such time as all places have been filled, therefore early application is advised You can choose either the Case Study (10 credits) OR the Dissertation (30 credits). Most students do not do a research project, preferring to build up their 90 credits for the MSc by taking taught modules. If you are considering a research project and have a good idea for one, then you should contact the Course Directors to discuss it. Some examples of recent can be found here https://docs.google.com/document/d/1vNDhycRgH2jRHdVXX0vQRRp9t5njzBDQN1BWtfwU-ak/edit?usp=sharing"},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Postgrad Part-Time", "course_title": "Fundamentals of Data Science", "description": "The Postgraduate Certificate in Fundamentals in Data Science (Conversion) is a one-year part time course which aims to provide non-computing graduates an opportunity to upskill in the developing area of data analysis and data science. This is a postgraduate course at level 9 in the National Framework of Qualifications. Applicants are required to have a strong numerate background. The course covers the key skills needed for an entry level position in data analytics, including modules in programming, databases, data wrangling and data analysis. It is very practically focussed with students developing skills in the main tools, methods and techniques used in the domain. It is a part time course with evening delivery, over two evenings per week."},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Postgrad Part-Time", "course_title": "Computer Science (Data Science)", "description": "The MSc in Computer Science (Data Science) course aims to produce graduates with the knowledge and skills to work with large amounts of raw data and extract meaningful insights from it. Graduates are equipped with deep technical skills (in data management, data mining, probability and statistics, and machine learning), but also with the softer skills (in communications, research and problem solving) required to work effectively within organisations. Data Science has been highlighted in a range of recent reports as an area of strategic importance both nationally and internationally. Areas in which opportunities for data analytics practitioners exist include retail, financial services, telecommunications, health, and government organisations. Specific roles include but are not limited to: Data Analytics Consultant, Data Scientist, Data Analyst, Data Architect, Database Administrator, Data Warehouse Analyst, Business Intelligence Developer, Business Intelligence Implementation Consultant, Business Analyst, Reporting Analyst."},
{"institution": "University College Dublin", "level": "Postgrad", "course_title": "MSc in Advanced Software Engineering", "description": "Software Engineering is a dynamic field where technology, techniques and processes continually evolve and fresh areas of application appear frequently. Software engineers must continually update their skills and qualifications in order to stay relevant in the workplace and improve their career prospects in the industry. This part-time Masters programme is designed for experienced software engineers who wish to advance their skillset in areas of computer science and software development that impact directly on their work. Participants are exposed to current technologies, methodologies, processes and theories as well as those still under research that may become mainstream in the future. This is an online, two-year, September-start, part-time programme. Six modules are taken at a rate of three per year. Each module is offered online over a 12-week trimester (Autumn or Spring), usually with a written examination taking place at the end of the module. Typical annual intake is about a dozen students. Part Time option suitable for: Domestic(EEA) applicants: International (Non EEA) applicants currently http://www.inis.gov.ie/en/INIS/Pages/I%20want%20to%20study%20a%20degree%20programme%20course outside of the EEA Region. ./!W_HU_MENU.P_PUBLISH?p_tag=MODULES&MAJR=T376 The ASE programme involves taking six modules (60 credits) and a Masters dissertation (30 credits). If all modules are passed and a 2.1 honours standard is achieved, the student may proceed to the dissertation component. Otherwise, the candidate completes with a Graduate Diploma. In each year the student takes three ASE modules, which are delivered fully online. Online delivery: The details will vary from module to module, but online delivery will usually be structured as follows: - The material is offered online as a number of packages. - Each package comprises lecture slides, study material, a video of the lecturer presenting an overview of the material and assignment work. - A Teaching Assistant may be available throughout the module to answer questions regarding assignment work, either on a group chat or by email. - Regular online Q&A sessions may be provided. The dissertation period commences in the second year and the dissertation is usually submitted in May, with an option to extend the deadline to the following December. Each module typically comprises 24 hours of lectures, as well as assignment/project/essay work to be undertaken in the student's own time. MSc Advanced Software Engineering (T376) Part Time EU           fee per year - € 5010 nonEU    fee per year - € 14550 For definitive fee information, please see https://www.ucd.ie/students/fees/ , choose EU or non-EU, and search for programme code [T376]. The annual EU fee for this Masters degree for 2024/25 is €5010. Fees are set by the University and all fee-related queries should be directed to the UCD Fees office. For suitably qualified non-EU applicants to the MSc ASE who do not qualify for EU fees, the School of Computer Science can offer a discretionary scholarship of €3,000 per annum, for the two years of the programme. Simply apply as normal, and let the Programme Director know that you wish to be considered for this scholarship. Students entering this programme are expected to have at least a 2.1 honours bachelor's degree in Computer Science (or a closely-related discipline) and have two or more years of subsequent industrial experience in software development. Prerequisite skills include a high degree of proficiency in object-oriented programming and experience in software development as part of an Agile team. Each application will however be assessed on a case-by-case basis, and exceptions to these rules may be made. Please note that this programme is not suitable for new graduates with little or no industrial experience. Although the modules are all delivered online, it may be essential to attend UCD to sit end-of-trimester exams, so this programme is not suitable for applicants who would need a visa to study in Ireland. The following entry routes are available: * Courses will remain open until such time as all places have been filled, therefore early application is advised Students apply directly to UCD via the http://www.ucd.ie/apply system (applications for this course close 30th August 2024) Fully completed applications are processed on a regular basis. If you encounter problems using the online applications system, please seek help via the https://www.ucd.ie/students/studentdesk/contact/ . For any questions you have about about the programme, be they academic or administrative in nature, please contact us at mailto:rosemary.deevy@ucd.ie?subject=UCD%20MSc%20Advanced%20Software%20Engineering&body=Dear%20Rosemary%2C%0A%0A ."},
{"institution": "University College Dublin", "level": "Postgrad", "course_title": "MSc/HDip in Computer Science (Conversion)", "description": "UCD offers a skills conversion graduate programme for individuals who hold a primary degree in another discipline (e.g., Arts, Commerce, Engineering), and would like to enter an IT-related career. This programme provides a thorough foundation in modern Computer Science in a practically oriented learning environment. On completion of the programme you will be able to demonstrate an integrated knowledge and understanding of the scientific principles of Computer Science; demonstrate competence and specialist knowledge in areas such as Programming, Data Science, Software Engineering, Web Application Development, Database Design, Cloud and Distributed Computing, Artificial Intelligence and Cognitive Science; undertake independent innovative research and development projects; and work with confidence both autonomously and as part of a team on projects related to real-world computer science applications. A research practicum allows students to apply the skills learned in the taught modules in a more significant project and to see where these skills can play a role in industry. In the final trimester, students choose 30 credits of taught modules from the MSc Computer Science (Negotiated Learning) programme. This programme has been specifically designed for graduate students of disciplines other than Computer Science. No prior knowledge of programming is assumed. During the first year, students take modules with learning outcomes aimed at providing fundamental skills required by modern technology companies. https://www.ucd.ie/science/t4media/ucdscience_grad_courses.pdf (pdf) Ireland is home to the world’s top 10 technology companies. It is known as the Internet and Games Capital of Europe and is among the world’s most technologically developed nations. There are excellent job opportunities, with 5,000 job vacancies in the sector at present. Some of the roles graduates of this MSc have worked in include the following: Companies that have employed graduates include IBM, Dell, Accenture, SAP, Mastercard, Computershare Ireland, Deloitte Ireland, First Derivatives, General Motors, Bearing Point, Logentries, AIB, Eircom and Paddy Power. High achieving graduates from this programme may also be eligible to pursue a graduate research degree in a Computer Science related field. Full Time option suitable for: Domestic(EEA) applicants: International (Non EEA) applicants currently http://www.inis.gov.ie/en/INIS/Pages/I%20want%20to%20study%20a%20degree%20programme%20course outside of the EEA Region. The MSc. Computer Science (Conversion) is an NFQ Level 9 skills conversion programme aimed at students holding a primary degree in another discipline (e.g., Arts, Business, Social Science, etc.) who wish to gain a postgraduate qualification in Computer Science. Building on key transferable graduate outcomes of communication, reflection, critical thinking and independent learning that our students bring to the programme, we seek to develop individuals with a passion for Computer Science and the skills and experience necessary to enter into an IT-related career. We aim to provide a learning environment that is practically-oriented and place a strong emphasis on developing competence in core Computer Science topics and programming skills. As such, the teaching, learning and assessment approaches focus on hands-on practical sessions with assignments and MCQs, individual/group projects and presentations, and enquiry-based learning activities. All of these approaches are designed and delivered by leading academics at the UCD School of Computer Science specifically to facilitate the transition of non-Computer Science graduates into the IT sector. MSc Computer Science (Conversion) students undertake a significant project-based research practicum during the summer months and create an individual portfolio with specific project and overall programme outcomes. The final semester allows students to specialize or tailor the programme to their interests with advanced and research-led modules. ./!W_HU_MENU.P_PUBLISH?p_tag=MODULES&MAJR=T195 MSc Computer Science (Conversion) (T195) Full Time EU           fee per year - € 10100 nonEU    fee per year - € 29100 If English is not your native language, unless you have done your primary degree through English in an English speaking country, an English language qualification is required for all programmes. Applicants whose first language is not English must also demonstrate English language proficiency of IELTS 6.5 (no band less than 6.0 in each element), or equivalent. These are the minimum entry requirements – additional criteria may be requested for some programmes The individual specialisations offered after the first year allowed me to explore and focus on my interests, ultimately graduating with a solid understanding of my chosen field. I’ve since decided to continue my learning journey with UCD after being accepted to a fully funded PhD in Artificial Intelligence. I cannot overstate how much I have gained in pursuing the MSc Conversion in Computer Science in UCD. The following entry routes are available: * Courses will remain open until such time as all places have been filled, therefore early application is advised"},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Postgrad Part-Time", "course_title": "Computer Science (Advanced Software Development)", "description": "The MSc in Computer Science (Advanced Software Development) aims to produce graduates with the knowledge and skills to develop the complex software solutions that organizations need to compete in the emerging global digital economy. The target audience is those with an undergraduate qualification in computer science or software development. Students will study advanced technical modules in programming, design, databases, architecture and web development to acquire the technical knowledge needed to practice as software developers working on leading edge development projects. In addition students will be equipped with key professional, technical communications skills needed to practice as a professional in the computing industry. Graduates completing the MSc will be qualified to take up strong technical roles in software development teams in a range of organisations. Specific opportunities include: software developer, software engineer, test engineer, software designer, systems analyst, web developer, technical consultant."},
{"institution": "University College Dublin", "level": "Undergrad", "course_title": "BSc in Computer Science/with Data Science", "description": ""},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Postgrad Full-Time", "course_title": "Data Science", "description": "The Postgraduate Certificate in Data Science is a one-year part time course which aims to provide science, engineering and computing graduates an opportunity to upskill in the developing area of data science and machine learning. The course covers the key skills needed for an entry level position in data science, including modules in data wrangling, data mining, data visualisation, probability and statistical inference and machine learning. It is very practically focussed with students developing skills in the main tools, methods and techniques used in the domain. Data science has been highlighted in a range of recent reports as an area of strategic importance both nationally and internationally. Areas in which opportunities for data science practitioners exist include retail, financial services, telecommunications, health, and government organisations. Specific roles include but are not limited to:"},
{"institution": "Dun Laoghaire Institute Of Art Design and Technology", "level": "Undergrad", "course_title": "BSc in Creative Media Technologies", "description": "Audio | Video | Electronics | Computing Creative Media Technologies is a practical, hands on course for those interested in technology and how it is applied to a number media platforms. Students study programming, electronics, audio and video technologies and have the opportunity to apply this knowledge in a range of practical environments. These range from the electronics labs of IADT to the studio environment of the National Film School. Students learn by doing; they invent, create and explore emergent technologies from 3D printers and digital fabrication to the Internet of Things. We are looking for makers and builders, creators and thinkers, people with the imagination to explore technology and design our future environment. You will have the opportunity to work with a range of technologies; hardware and software, video and broadcast technologies, visual technologies and audio technologies. You will have the opportunity to specialise according to your interests and utilise our facilities including computing and electronics labs, radio and state of the art television studios. Modules on mathematics, networking and signal processing will give you the tools to realise your creative ambitions. Recent graduates of this programme have the following job titles: Audio Visual Technician | Sound Engineer | IT Analyst | Software Developer | Electronic Technician | Controls Engineer | Production Co-Ordinator | Recent graduates are employed by AvCom, Digicom, Pearl AV, RTÉ, Setanta, Bausch & Lomb, Quaestor Analytic, Vodafone, Intel and Bank of America. Our graduates also on go to start their own companies."},
{"institution": "Dublin City University", "level": "Postgrad", "course_title": "M.A. in Data Protection and Privacy Law", "description": "The growth of the digital economy has resulted in personal data processing becoming a global industry of enormous value. The General Data Protection Regulation (GDPR), which came into effect in May 2018, aims to protect EU privacy rights and harmonise data protection law across the EU. The GDPR changes the way in which personal data must be collected, stored and processed. Given that personal data is used so widely, the GDPR impacts upon a vast number of sectors and data privacy has become an important concern for businesses, internet users, lawyers and public bodies. The MA in Data Protection and Privacy Law is an interdisciplinary degree run jointly by the School of Law and Government and the School of Computing. The aim of the programme is to combine the University’s expertise in law and computing to provide students with advanced expertise in the technological and legal aspects of data protection and privacy law. To facilitate both interdisciplinarity and specialisation, the MA will be divided into two streams: law and computing. Entrance on to either the law or computing stream will be dependent upon existing education. All students will complete 4 core modules which will offer a mix of law and computing and will be accessible to all admitted students. For example, the core law modules will be accessible to students from a non-legal background and the core computing modules will be accessible to students from a non-computing background. Students on the law stream will complete a law focused research module, a law dissertation, the core modules common to both streams and pick two optional modules. Students on the computing stream will complete a computing focused research module, a computing practicum, the core modules common to both streams and pick two optional modules. In addition to providing a comprehensive grounding in both areas, the MA will allow students, through the research dissertation or practicum, in addition to the optional modules, to achieve a higher level of expertise in either computing or law."},
{"institution": "University College Dublin", "level": "Undergrad", "course_title": "MSc in Computer Science (Negotiated Learning", "description": "The MSc Computer Science (Negotiated Learning) is a uniquely flexible and innovative programme. It offers a negotiated learning model for students with an ICT background that allows you to customise your learning path and to tailor what you learn to your own specific needs and career aspirations. Module choices include several programming languages, cloud computing, bioinformatics, data mining, machine learning and information visualisation. Once you are accepted onto the programme we will guide you through a student needs assessment to establish your prior experience, personal knowledge gaps and your career plans. You have the option to select modules with a very specific thematic focus or you may select modules from one of the pre-defined themes covered by the programme. Currently, there are approximately 100 module options offered in conjunction with other UCD Schools and Units including Business, Physics, Mathematics and Statistics, Psychology, Law and NovaUCD. https://www.ucd.ie/science/t4media/ucdscience_grad_courses.pdf Previous graduates are in demand and among their recent career destinations are employers like Google, SAP, Intel, PayPal, Deloitte, Microsoft, Symantec, HMH, Vilicom, Murex, NYSE Technologies, Realex Payments, Version 1, Salesforce, Pfizer, Ericsson, and Intune Networks. Recent graduates have secured roles in areas including: hardware design, software engineering & QA, data programming & analysis, commercialisation of technology, teaching & training, senior management & CEO roles, security & forensics consultancy, and bioinformatics R&D. Full Time option suitable for: Domestic(EEA) applicants: International (Non EEA) applicants currently http://www.inis.gov.ie/en/INIS/Pages/I%20want%20to%20study%20a%20degree%20programme%20course outside of the EEA Region. Part Time option suitable for: Domestic(EEA) applicants: International (Non EEA) applicants currently http://www.inis.gov.ie/en/INIS/Pages/I%20want%20to%20study%20a%20degree%20programme%20course outside of the EEA Region. The programme is attractive to industrial workers coming from related computer science and IT disciplines, and/or national and international students with relevant computer science undergraduate degree qualifications, who have specific workplace needs or requirements for continuing professional development. Once an applicant has accepted his/her place on the programme there is a for each individual student and the establishment of a between the School of Computer Science (represented by the Programme Director) with the student. Students have the opportunity to negotiate a programme of learning that is tailored to their own career goals and requirements. Instead of there being a rigorous set of modules that each student must take, as is typical in standard taught MSc programmes, students can prefer to broaden their knowledge across by Schools such as the UCD School of Computer Science, UCD School of Business, UCD School of Mathematics and Statistics and the UCD School of Information and Communication Studies. Students enrolling in this MSc are also provided with the opportunity to work on a specialised research task and/or work as part of a research group as part of this programme. (i) Purpose This programme aims to provide students with a wide range of specialist learning opportunities that can be selected in a bespoke manner to suit the individual skills and aspirations of the individual.  It can thus serve both as a form of extended continued professional development, as a means to upskill or to reorient a technical career.  The programme is also suited as a foundation for advanced research within IT. An extensive variety of learning pathways is offered, with many modules grouped into thematic streams, providing coherent clusters in specific technical areas. (ii) Education and subject description, professional values It aspires to offer state of the art instruction in a very wide variety of technical subjects, leveraging the broad range of expertise available in the faculty of UCD.  For the student, it provides an opportunity to personally design a course of study that matches their specific goals.  Modules range over many technical specialities that are in high demand with employers. (iii) Learning outcomes Students will select modules from a very broad list, and will therefore encounter many different kinds of instruction.  Many students will take part in group projects of a practical nature. The variety of modules on offer ensures that students can develop both technical skills and enhance their critical thinking. (iv) Approaches to teaching learning and assessment Because of the variety of courses on offer, many different forms of evaluation may be used, including exercises, written assignments, programming challenges, literature reviews and end of module examinations.  The programme aspires to encourage the intellectual skills required to synthesise and integrate insights from many perspectives. No Modules to display for this  Course MSc Computer Science Negotiated Learning (T150) Full Time EU           fee per year - € 9300 nonEU    fee per year - € 29100 MSc Computer Science (T151) Part Time EU           fee per year - € 5010 Tuition fee information is available on the http://www.ucd.ie/fees . Please note that UCD offers a number of graduate scholarships for full-time, self-funding international students, holding an offer of a place on a UCD graduate degree programme. For further information please see http://www.ucd.ie/international/study-at-ucd-global/coming-to-ireland/scholarships-and-funding/ . All students are offered the opportunity to undertake an internship during the programme. The following internships are examples of past placements: Amazon, SAP, Dell, Ericsson, HubSpot, Geowox, FoodMarble, HealthBeacon, Autodesk, Microsoft, Equifax, Groupon, Workday, Honeywell, Intel, Shutterstock The programme was a huge step forward in my career. After the completion of the programme, I secured a full-time job as a programmer at Equifax Technology. The MSc Computer Science (Negotiated Learning) course gave me the freedom to pick the modules I wanted to study, so I was able to study what I loved and what I needed. The following entry routes are available: * Courses will remain open until such time as all places have been filled, therefore early application is advised"},
{"institution": "Dun Laoghaire Institute Of Art Design and Technology", "level": "Undergrad", "course_title": "BSc in Creative Computing", "description": "Apply and develop your creativity in the thriving and dynamic area of computing. Gain the hands-on skills and knowledge to create solutions for today’s fast-paced world. Learn core computing skills such as programming, app development and databases, while keeping a focus on the design of the technology interaction with the user. Develop computing skills using your imagination and interests Create exciting apps, websites and games & learn to program in Java and related languages Use media elements (text, graphics, audio, images, video and animations) to develop websites with HTML, CSS, PHP and JavaScript Benefit from small class sizes and industry-experienced teaching team Choose a specialist area of study, such as Data Visualisation, Artificial Intelligence, Gaming, Data Science, and Virtual/Augmented Reality (Years 3 & 4) Use state-of-the-art computer labs within a friendly and supportive environment Opportunities to study abroad for a year through the Erasmus Programme. Partnerships with Stuttgart Media University in Germany and Sabanci University in Istanbul In Year 3, students spend the second half of the year working with an industry partner"},
{"institution": "Dublin City University", "level": "Postgrad", "course_title": "MSc in Electronic Commerce", "description": "This programme is focused on the Internet of Things [IoT]  and leads to a final Award of MSc in Electronic and Computer Technology [IoT]. It aims to provide a pathway for bachelor’s degree graduates, existing ICT professionals, and those wishing to convert from associated disciplines, to acquire the necessary skills to pursue careers in the IoT technology and applications domain. The Internet of Things [IoT] is a computing concept describing the inter-connectivity and collaboration of a wide variety of everyday physical objects connected via the internet. Rapid IoT development has been driven by ongoing research and technological advances (notably in 5G mobile communications and in Artificial Intelligence). IoT technologies are enabling a wide range of business opportunities in the context of “smart” homes, neighbourhoods and cities. They also enable the exploitation of intelligent infrastructure and services, in areas such as transport, power and healthcare. IoT systems involve the convergence of multiple technologies, existing and new, including Sensors & Actuators, Low-energy Communication, Networking and Cloud, Big Data & Data Analytics, Machine Learning, Security and Application Deployment and Management. There are two intakes onto the programme, in February and September, and flexible study options are provided. Due to the scheduling of project deadlines, full-time students who start in September can complete the programme within 12 months, while full-time students who start in February can complete the programme within 18 months. NFQ Level 9 Graduate Diploma and Graduate Certificate exit awards are also available. This programme satisfies the educational requirement for an for non-EEA students. About this course The programme offers advanced-level courses in the theory, analysis, design and modelling of electronic and computer technology in an up-to-date, industry-relevant modern programme, which aims for students: In order to achieve the MSc in Electronic and Computer Technology with a Major in IoT a student needs to complete 90 credits in total over the duration of the programme. Taught Modules (Choose 9 from the following set with a minimum of five EE5xxx modules): Project Modules (both are compulsory and run in the summer months): For further information including the possibility of scholarship, please visit:"},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Postgrad Full-Time", "course_title": "Computing (Fundamentals of) Masters Qualifier", "description": "The MSc in Computing Masters Qualifier will offer graduates in non computing disciplines the opportunity to acquire the core knowledge of computing concepts necessary to be eligible for entry to the MSc in Computing programme in the School of Computing. The philosophy behind the qualifier is that graduates from other disciplines will have developed significant transferable skills in analysis, communications and independent learning and so will be in a position to learn a focused subset of computing knowledge quickly. Graduates of the Masters Qualifier exit with a Continuing Professional Development Diploma in Fundamentals of Computing and those who pass all modules and achieve an overall average mark of 60% can progress directly to the MSc in Computing programme."},
{"institution": "Dublin City University", "level": "Postgrad", "course_title": "MSc in Computing (with Major Options)", "description": "The MSc in Computing offers a choice of Majors, designed to equip graduates with a range of cutting-edge skills, enabling them to produce high-quality software and systems that deliver solutions to business and the economy. Watch our course video . (This Major is available Full Time Only) Natural Language Processing (NLP) combines computer science, linguistics and artificial intelligence. The aim of NLP is to develop computer programs with the ability to understand and produce text, as demonstrated in recent chatbots like ChatGPT, LaMDA, and BARD. NLP is an exciting field, because it has the potential to transform the way we interact with machines and each other, and to make our lives easier and more efficient. In cutting-edge research, large language models like the one at the heart of ChatGPT are even beginning to be used for increasingly general AI system development. Natural Language Processing specialists are in high demand. They are needed to develop and improve technologies such as text classifiers, chatbots, virtual assistants, and language translation systems, which are used by many industries, including e-commerce, healthcare, finance, and more. With the increasing amount of data being generated, the ability to process and understand human language has become crucial for many businesses to make informed decisions. As a result, there is a shortage of skilled NLP professionals, and companies pay highly competitive salaries to attract talent in this field. This is the first Natural Language Processing master’s degree in Ireland. It has been developed by world-leading academics working in NLP, and is taught by a team of experts from a diverse range of computer science backgrounds including natural language processing, data science, artificial intelligence, and machine learning. An expert panel of industry NLP professionals will deliver a series of guest lectures and engage in practicum supervision. Taught intensively over nine months and building on your background in computer science, this master’s will equip you with the skills you need for a successful career in this fast-growing field. (This Major is available both Full Time and Part Time) This exciting new Major, delivered in conjunction with leading industry players, builds on the School of Computing's expertise and its involvement with Insight, Science Foundation Ireland's Centre for Data Analytics and ADAPT, the centre for new Human Centric AI techniques. Technologies such as the internet, sensor nets, social media and cloud computing are generating vast amounts of data. To say we are drowning in information is an understatement. Yet in this vast amount of raw data, there are gems of knowledge that can be used to improve processes and generate value. This Major provides students with a deep understanding of the issues, techniques and tools to examine large amounts of raw data in order to extract meaningful conclusions from the information these contain. (This Major is available Full Time Only) There is a strong demand for graduates with the highly specialised multi-disciplinary skills that are required in AI, both as practitioners in the development of AI applications and as researchers into the advanced capabilities required for the creation of next-generation AI systems.  This Major is designed to meet this educational need, by providing a balanced programme of instruction across a range of relevant areas. (This Major is available both Full Time and Part Time) In this modern age of increased data usage and ubiquitous computing the security of software is more important than ever. This updated and revised MSc. Major in Secure Software Engineering builds a firm base of advanced software engineering skills and emphasises security from start to finish. It will be appropriate for all those tasked with building and researching secure software systems. (This Major is available Part Time only) The innovation enhanced by the emergence of Financial Technologies (FinTech) holds the prospect of a shift of power over everyday financial transactions away from those who have hitherto held it (in large Financial Organizations) and towards the general population, leading to a potential ‘democratisation’ of finance in areas such as Aggregation, Micro Investing and Crowd-funding. Other key application areas of FinTech Innovation have been towards empowering companies in the Financial Services sector, predominantly in Payment Services and Regulatory Compliance by simplifying and automating their processes. In this major we draw a distinction between those who actually develop the products which have the potential to empower and those who would use them in a business context. It has been developed to deliver the requisite FinTech background knowledge in key underpinning areas such as Data Governance and Financial Time Series as well as technologies necessary in developing Innovative FinTech technologies e.g. AI and Blockchain. The strong practical focus of the programme culminates in a project practicum, carried out over the summer months. Typically, students will develop a prototype software system in their Major area that targets a real-world problem. They may also analyse processes or techniques, and propose and evaluate alternatives. Most projects are individual but, exceptionally, may be carried out as part of a team. Students may also be sponsored by external clients or develop their own ideas. Typically, projects commence with a feasibility study, followed by the creation of a project plan and development of a software application or rigorous theoretical analysis. Over the duration of the programme, students will develop employment-enhancing skills across a number of key areas. These include: (This Major is available Full Time Only) - Foundations of Natural Language Processing - Introduction to Machine Learning - Professional & Research Practice - Human Factors in NLP - Deep Learning for Natural Language Processing - Advanced Machine Learning - Data Analytics & Data Mining - Machine Translation (Elective) - Mathematical Methods/Computational Science (Elective) (all of the above are 7.5 ECTS each) - NLP Practicum (30 ECTS) (This Major is available both Full Time and Part Time) - Professional & Research Practice - Statistical Data Analysis - Cloud Technologies - Data Management and Visualisation - Mathematical Methods/Computational Science - Artificial Intelligence, Information and Information Seeking - Data Analytics and Data Mining - Machine Learning (all of the above are 7.5 ECTS each) - DA Practicum (30 ECTS) (This Major is available Full Time Only) - Professional and Research Practice - Foundations of Artificial Intelligence - Statistical Data Analysis - Data Analytics and Data Mining - Machine Learning - Artificial Intelligence, Information and Information Seeking - Data Management and Visualization - Statistical Machine Translation (Elective) - Mechanics of Search (Elective) (all of the above are 7.5 ECTS each) - AI Practicum (30 ECTS) (This Major is available both Full Time and Part Time) - Professional & Research Practice - System Software - Secure Programming - Cryptography and Number Theory - Formal Programming - Concurrent Programming - Software Process Quality - Network Security (all of the above are 7.5 ECTS each) - SSE Practicum (30 ECTS) (This Major is available part-time only) - Professional and Research Practice (7.5 ECTS) - FinTech - Financial Innovation (5 ECTS) - Data Governance (10 ECTS) - Blockchain:  Basics and Applications (7.5 ECTS) - Statistical Data Analysis (7.5 ECTS) - High Tech Innovation & Entrepreneurship for FinTech (7.5 ECTS) - Machine Learning (7.5 ECTS) - Data Analytics and Data Mining (7.5 ECTS) - FinTech Practicum (30 ECTS)"},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Postgrad Full-Time", "course_title": "Computer Science (Data Science)", "description": "The MSc in Computer Science (Data Analytics) programme aims to produce graduates with the knowledge and skills to work with large amounts of raw data and extract meaningful insights from it.  Graduates are equipped with deep technical skills (in data management, data mining, probability and statistics, and machine learning), but also with the softer skills (in communications, research and problem solving) required to work effectively within organisations. Data analytics has been highlighted in a range of recent reports as an area of strategic importance both nationally and internationally. Areas in which opportunities for data analytics practitioners exist include retail, financial services, telecommunications, health, and government organisations. Specific roles include but are not limited to:"},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Postgrad Full-Time", "course_title": "Computer Science (Advanced Software Development)", "description": "The MSc in Computer Science (Advanced Software Development) aims to produce graduates with the knowledge and skills to develop the complex software solutions that organizations need to compete in the emerging global digital economy. The target audience is those with an undergraduate qualification in computer science or software development. Students will study advanced technical modules in programming, design, databases, architecture and web development to acquire the technical knowledge needed to practice as software developers working on leading edge development projects. In addition students will be equipped with key professional, technical communications skills needed to practice as a professional in the computing industry. Graduates completing the MSc will be qualified to take up strong technical roles in software development teams in a range of organisations. Specific opportunities include: software developer, software engineer, test engineer, software designer, systems analyst, web developer, technical consultant."},
{"institution": "Dublin City University", "level": "Postgrad", "course_title": "MEng in Electronic and Computer Engineering", "description": "This 90-credit programme, delivered by the , is at the highest European Masters degree level. It provides advanced engineering courses in the theory, analysis, design, implementation, and manufacture of electronic and computer systems. With 30 taught modules to select from, the programme is highly flexible and allows participants to design their Masters programme to match their chosen career specialisation. Students may opt for the General Masters programme, offering maximum flexibility of module choice, or take the option of specialising in one of the following Majors: Along with four core Majors modules and a major-specific masters project, students choose four complementary modules. This allows additional skillsets to be developed to enhance, or diversify, their chosen Major speciality. See Programme section below for links to module options. Full-time students beginning in September may complete the programme in 12 months. Full-time students beginning their studies in January may complete in 18 months. Flexible study options are also provided for part-time students. An alternative entry path is available for EU-status students who do not meet the Masters programme entry requirements. Note: Non-EU students, who require a visa to study in Ireland, cannot take the Masters Qualifier. Students take a total of eight taught modules plus a year-long masters project. Taught modules are taken in Semester 1 (Sept-Dec) and Semester 2 (Jan-Apr). The masters project runs from October to August of the following calendar year, so students beginning their programme in September can complete in a total of 12 months. Students may opt to begin their programme in January (Semester 2), in which case they start their project the following October, completing the programme in a total of 18 months. Part-time students have the flexibility of taking the programme over multiple years (up to a maximum of four years). Note: The part-time study option is available to EU-status students only. Non-EU students who require a visa to study in Ireland must take the programme on a full-time basis. The MEng in Electronic and Computer Engineering programme structure and module choices may be viewed An introduction to each Major topic is available Please note that module and major offerings are renewed on a regular basis. Available modules are confirmed in advance of each academic year, in April/May. The masters project is a 12-month, 30-credit module that allows students to put theoretical knowledge of engineering to use in a practical project related to their major topic. Students will develop skills in planning and managing their engineering project, researching leading-edge methods and technologies, designing and implementing an engineering solution, and documenting and presenting outcomes of their key findings at a professional standard. Each student works individually with an academic member of staff acting as their project supervisor."},
{"institution": "Dublin City University", "level": "Undergrad", "course_title": "BSc in Computing for Business", "description": "Every business and industry needs smart, versatile graduates who understand computing and technology, and who can make smart use of innovations like artificial intelligence, cloud computing and machine learning. During this course, you’ll learn coding and programming, and get to grips with databases, operating systems and networks. But you’ll also study innovation and entrepreneurship, project management and presentation skills. In your last year, you can even develop your own app, and build both a prototype and a rock-solid business plan. Real-world industry experience is incredibly valuable and as a third-year Computing for Business student, you get to immerse yourself in a business environment on a seven-month work placement. That could be with any business in Ireland, from a fast-scaling start-up to a high-tech multinational. And you can study abroad for a semester too. Whether you want to be a business analyst, an IT solutions architect, a project manager, a web developer or an entrepreneur, this course will give you the skills, knowledge and insight to thrive in the rapidly changing world of business."},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Undergrad", "course_title": "Business Computing", "description": "This course aims to develop skilled IT professionals with strong software and related skills and a good knowledge of how businesses function. It combines computer studies, particularly software development, with business subjects. On graduating, you’ll combine technical, business and interpersonal skills regarded as being important to industry, and that are in constant demand by employers. The technical skills include a high level of proficiency in Object-Oriented Software Development through Java and Ruby. The Interpersonal Skills, Communication Skills and the Project Management modules along with a work placement will develop your personal effectiveness in the workplace, while business and information systems topics provide a framework for workplace effectiveness. In Year 3, students can choose to go on a work placement."},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Undergrad", "course_title": "BSc Hons Comp Science (international)", "description": "Software is a global industry with a strong presence in Dublin, considered as the Silicon Valley of Europe. This course will provide you with the knowledge and skills to work as a global software engineer or as an application developer, able to develop as needed in an ever-changing global industry. On graduation, you’ll be qualified to work in the international IT industry in a wide range of computer roles. You’ll have a strong foundation in such areas as Internet development, cloud computing, mobile software, enterprise systems, artificial intelligence and games technology. You’ll learn IT skills early on that are required in the international IT industry, including core software design and development skills as well as highly sought-after international skills such as global citizenship, software localisation, entrepreneurship, and creating webinars. You can also select to study a foreign language (German, Chinese or Korean). In the final year, you can specialise in a variety of areas such as Enterprise Systems Development, Applied Intelligence or Digital Games Development & Simulation. TU Dublin has strong links with global industry companies such as Google, Microsoft and IBM, through sponsorship and project co-operation. Students can showcase their final-year projects at our project fair and meet with industry company representatives. If you do not undertake an International Industrial Placement, you must spend your second semester in Year 3 on an international study exchange at one of our university partners in Europe, China or Korea. There are also opportunities for spending all of Year 3 studying abroad, participating in our double-degree courses in either Germany, Finland or Korea. In Year 3, you can undertake an International Industrial Placement in an IT company. In addition, all Year 3 students participate in the Global Classroom, a virtual, online classroom comprised of teams of international students on exchange at our international university partners. This emphasises the importance of globalisation and simulates how a team can design and develop software with team members in different locations."},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Certificate in Enterprise Web Development", "description": ["This module aims to equip students with the knowledge and practical skills to design, develop and deploy Full-Stack Serverless web applications.", "We address all aspects of the technology stack used to satisfy both functional and infrastructure requirements. An industry-standard frontend UI framework will be examined in detail (e.g. React). The serverless model dominates the backend technologies, using the AWS platform offerings. Automation of infrastructure provisioning will also be considered using a modern IaC framework. The Typescript language is used in all implementation layers and taught in a condensed form at the beginning of the module.", "There is a strong emphasis on practical learning. The labs guide the student through developing a baseline full-stack app, which they then enhance and submit as their assessed work. The module is 100% continuous assessment.", "A prerequisite is that the student is a competent programmer with some knowledge of web technology (HTML/CSS)."]},
{"institution": "Dublin City University", "level": "Undergrad", "course_title": "BSc in Computer Science", "description": "If you want to know how computers work and learn how to develop cutting-edge computer, internet and mobile technology, choose Computer Science. Along with programming, you’ll study advanced data tools and algorithms, databases, networks and cryptography, along with other much needed skills such as critical thinking and communications skills. At DCU, our Computer Science course has a strong emphasis on software engineering, which is writing, modifying and maintaining software systems. You’ll get to study DevOps and full stack development in second year and use Git for all your project work – these hands-on, practical approaches based on the latest industrial practices. In third year, you’ll go on a six-month work placement at a tech company and you have the option to study abroad too. There is huge demand for graduate software engineers and systems analysts, so you’ll find a world of opportunity awaits once you finish this course!"},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Undergrad", "course_title": "BSc (Hons) Information Systems and Information Technology", "description": "Graduates of this part-time, industry-oriented course are equipped with the advanced skills necessary to function as information technology professionals in a broad range of commercial, industrial and public sector environments. In view of the rapidly changing nature of the computer industry, graduates are equipped with a wide and educationally sound background in order that they may possess the flexibility likely to be required for future career development. Written assessment and/or continuous assessment for each module taken. Exemptions from certain modules and/or stages may be available to students who have already completed a relevant academic course. Graduates of this course are equipped with an industry-relevant qualification, facilitating their entry into the ICT industry or their progression within this industry. As is typical of an undergraduate qualification, graduates have knowledge and skills across the breadth of the ICT area with a specialisation through their choice of domain for their final year project. Graduates of the BSc (Honours) can apply for membership of the Chartered Institute for Information Technology and can apply for status as Chartered IT Professional or Chartered Engineer following the acquisition of relevant experience post-graduation."},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Certificate in  Mobile Application Development", "description": ["This module will introduce and expand the principles, practices and tools for the development of modern Android applications using the Kotlin programming language.", "The module itself will consist of a mix of lectures and guided practical labs. The labs will apply the principles introduced in the lectures via the construction of a small number of interesting Android application case studies. These applications will further develop aspects of the material covered in the lectures.", "Students will be asked to develop their own Android application in Kotlin, with a spectrum of features, utilising a subset of modern Android components. This will constitute the single assignment for the module.", "Topics such as JSON persistence, navigation,  networking, the MVVM pattern and Firebase will be covered so students are expected to have strong object-oriented programming skills."]},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Undergrad", "course_title": "BSc (Hons) Computer Science", "description": "Computer scientists are critical to the global infrastructure that underlie our communications, finance, health, energy, transport and many other vital systems. Are you interested in understanding the algorithmic complexity of problems, automating human intelligence, providing ubiquitous access to information and designing secure and eﬀective software and computer systems? If so, this course will prepare you for work in an exciting industry. If you want to work as a software application developer in a variety of commercial and industrial environments, this course will equip you with the understanding and skills needed to progress in an exciting and constantly changing industry. It will qualify you to work in a wide range of computer development areas – whether in the mainstream computer industry or in stimulating, leading application areas such as internet applications development, games development, enterprise systems, e-commerce, music technology, systems technology, systems security, knowledge management and data mining. You will spend the early years of the course gaining a thorough grounding in the fundamentals of computer science; then develop highly relevant skills in software design and development. In your final year, you will specialise in a chosen field, such as Enterprise Systems Development (how to create large, scalable, safe, secure and reliable software systems using the latest technologies), Applied Intelligence (advanced methods in computer science such as machine learning and the Internet of Things), Digital Games Development & Simulation (how to design and implement computer games and simulated environments that model novel and complex worlds and characters) and, Security and Forensics (how to recover evidence from a computer system, providing security for information through Steganography and Cryptography algorithms). You can apply to participate in an international exchange for the second half of third year as part of your experiential learning. The third-year is focused on experiential learning. You will participate in a business and enterprise module, and may then opt to participate in our highly successful work placement programme. The School of Computer Science maintain close liaisons with various industry partners. Alternatively, you can work with community organisations on our innovative service-learning module, whereby you take responsibility for interesting ICT projects in the community. We have institutional links with many industry leaders such as Oracle, Microsoft, IBM, Facebook, VMware, Salesforce, SAP, Ocuco, Google, Twitter, Apple, LinkedIn through sponsorship, work placement, project co-operation and graduate employment."},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Certificate in Data Mining", "description": ["This module provides an overview of the main concepts and techniques in data mining. Data mining integrates machine learning and business understanding to extract valid, interesting insights from data. As such it is extremely important and widely used in today's world, across many disciplines and sectors.", "You will be introduced to the data model building pipeline, covering exploratory data analysis, feature engineering, model selection and optimisation and validation, underpinned by visualisation. Each machine learning task is introduced, its strengths and weaknesses are highlighted, and guidance for its use is given. The data mining tasks include clustering, classification, regression, and rule learning. The module is python-based and uses pandas for data processing, scikit-learn for most of the machine learning tasks, and matplotlib/seaborn for visualising both the data and the models that we derive from this data. You will be expected to complete the weekly python practicals that extend the coverage of the lecture topics by showing how they operate in practice, on real data sets. Assessment is based on being able to investigate data effectively using the tools from the module."]},
{"institution": "Trinity College Dublin", "level": "Postgrad", "course_title": "MSc in Computer Science", "description": "From retail and sports science to journalism and fintech, data scientists are increasingly at the heart of business and government. Whether it’s enabling product recommendations or helping a sports team decide what player to buy next, data science can unlock the secrets of any sector. If you like maths, creative problem solving and collaborative work, data science could really appeal to you. This course sits at the intersection of computer science, maths and business, enabling you to understand what is possible with cutting-edge technology such as machine learning and artificial intelligence. Not only will you learn programming skills and advanced maths so you can analyse and find trends in real world data, but you’ll also gain the communication skills to convey these insights to audiences who’ll appreciate the value of your analysis. You’ll study mathematics, statistics, programming, computational linguistics, computational modelling, cloud technologies, innovation and so much more. In third year, you’ll get to complete a nine-month INTRA work placement and also have the chance to study abroad. And after you graduate? Almost every industry is crying out for data scientists, data engineers and AI data scientists, so the career opportunities following this course are boundless. The DCU BSc in Data Science combines the three key skill sets of computing, mathematics and enterprise to provide the core knowledge needed to succeed in this growing area.  The course will introduce students to the major concepts in data analytics, management, processing, modelling, visualisation and enterprise.  Partnering with industry provides opportunities to engage with real-world problems and data sets. You will learn to program, to study mathematics and learn to apply these skills to data from the real world, communicating the results to different audiences. For more information on the programme content visit http://www.datascience.dcu.ie ."},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Undergrad", "course_title": "BSc (Hons) Computer Science (Infrastructure)", "description": "Computer Science (Infrastructure) is about developing software and infrastructure for applications ranging from those on smart devices to those in global corporations. This course provides the skills required to build data centres and networks, and to develop software securely, individually and in teams. Recent graduates work as software developers, software engineers and system administrators. No prior programming experience is required. Application areas include intelligent cities, ethical hacking, search-engine development, games, and legal and financial software. You’ll gain a working knowledge of the components of a computer and a network, become familiar with the components of an operating system, and learn to administrate large distributed systems. You’ll write programs in multiple languages for platforms varying from single-user, single-platform applications to multi-user, multi-layered distributed systems. You’ll learn how to ensure that an IT infrastructure complies with the most effective security techniques; learn many technologies, about web clients and servers, data storage, manipulation and analysis, the use of different platforms and physical devices, and techniques for developing systems, from small mobile devices to cloud-based services. You’ll learn how to integrate these technologies. You’ll also study the architecture and infrastructure of large systems; how to design, document, implement and manage them. In your final year, you’ll present your work at a highly regarded project fair to an audience of industry partners and experts. You can apply to participate in an international exchange for the second half of third year as part of your experiential learning. Erasmus places are available in a number of European countries and there are also other student exchanges in countries such as South Korea. All modules taken abroad are taught through English. You can apply for work placement in Year 3, to gain invaluable experience in the IT industry, or you can study further modules. Students earning BSc (Hons) will be eligible for Professional Membership of BCS, the Chartered Institute for IT (MBCS). Graduates are working as Software Engineers, Software Developers, Systems Administrators, Virtualisation Engineers, IT Security experts and Database Administrators in global organisations such as IBM, Amazon and Oracle, local successful companies such as Ocuco, Version 1 and Digital Planet, and in start-ups. Many also work in IT departments of banks, building societies and government organisations or as software or infrastructure consultants."},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Certificate Cloud Architecture [Postgraduate]", "description": ["This module aims to equip students with a comprehensive theoretical and practical appreciation of best practices in cloud architecture.  We make extensive use of Amazon Web Services (AWS) throughout the module.", "You will learn how to design and deploy secure and robust cloud computing infrastructure and applications.  Lab exercises will guide you through the set-up of a wide variety of components and services on the AWS global infrastructure.  In these exercises you will be exposed to such topics as performance, availability, security, monitoring and maintenance, fault tolerance, cost effectiveness, automation, messaging and notifications, database management, microservices, load balancing, event-driven scaling, and geographic considerations.", "SETU Waterford is a member institution of AWS Academy and this module is based on high-quality authorised AWS curriculum material.  On completion of this module, students are actively encouraged and supported to take the AWS Certified Solutions Architect – Associate exam", "Indicative Content", "• Introduction: What is Cloud Computing?; leveraging cloud computing; cloud economics", "• Cloud Infrastructure: Compute; Storage; Networking", "• Scalability: Event-driven scaling; Load Balancing; Monitoring", "• Cloud storage and databases SQL and NoSQL options; short and long term storage; performance, reliability, availabilty and cost", "• Design for Highly Available, robust application deployment Account configuration; network configuration; security; application routing and geographic considerations", "• Cloud Security Identity and Access Management; logging & monitoring; securing & encrypting data; authentication; key management; attack mitigation", "• Serverless Architectures", "• Cloud Architecture best practices Design principles; reliability; performance; cost optimisation; automation"]},
{"institution": "Technological University Dublin - City Centre Campus", "level": "Certificate", "course_title": "Computing", "description": "This course allows students to take any of the modules from our part time B.Sc. in Information Systems and Information Technology independently."},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Certificate Agile Software Development [Postgraduate]", "description": ["This module will address a subset of the tools and technologies required to support the development of reliable, efficient and scalable software services. The focus is on use of Agile Development methods requiring test-driven developed and regular automated software builds. The aim is to assemble a toolkit of modern tools that enable the set-up of a software development process where this structure is automated by the tools. Students taking this module should have strong object-oriented programming and design skills (e.g. be graduate of a BSc(Hons) or BEng involving significant programming experience) with a moderate understanding of computer architecture, operating systems and distributed computing.", "The module guides you through a variety of Agile tooling and technologies that you will use to support and automate your development process.  Initially, you will be introduced to the Kotlin programming language, which will be used in conjunction with the Javalin lightweight web framework to build a RESTful API.   During the app development process, the lab exercises will utilise a variety of technologies and Continuous Integration and Continuous Deployment (CI/CD) tooling such as Swagger for API design and documentation, Maven to automate the build process, Heroku to host the app, PostgreSQL and Jetbrains Exposed to provide persistence, Vue to develop the UX, JUnit5 and Unirest to perform automated unit and integration testing, GitHub for version control, and so on.  This module is designed to be very practical serving, and should you choose to pursue the Master’s degree, the contents of the module supports software development for the dissertation."]},
{"institution": "Waterford Institute of Technology", "level": "Postgraduate", "course_title": "Master of Science in Computer Science (Enterprise Software Systems)", "description": ["This MSc programme is designed to develop and refine a set of skills essential for successful engagement of enterprises with information and communications technology (ICT). The main themes of the programme are business systems analysis and enterprise software development, supporting the entire business systems lifecycle.", "Reason and problem-solve to a high level in the context of enterprise software and its role in business, industry and research;", "Participate constructively in the strategic deployment of enterprise software;", "Manage the development of high-quality enterprise software products and services;", "Undertake research-based projects for industry, providing effective advice and leadership where required;", "Manage technology-based projects that require the handling of innovation and change in dynamic environments.", "Whereas this course is targeted at IT professionals who would participate in the programme on a part-time basis and complete the programme over two years, the modular design also allows for completion in one year full-time. The structure of this programme is the same as the other taught MSc in Computing courses within the Department of Computing Maths & Physics (CMP) in SETU Waterford.", "It is a 90 credit programme consisting of 6 taught modules plus a dissertation and was developed through consultation with IT and software development companies in the South East region, see module groupings below.", "For information on fees please visit our web page at", "Funding may be available from Waterford Chamber Skillnet", "Graduate Admissions", "Registrar’s Office", "South East Technological University, Waterford Campus,Cork Road, Waterford City,", "Co. Waterford, Ireland", "X91 K0EK", "Ireland", "Tel: +353 0818 121212", "Email:"]},
{"institution": "Trinity College Dublin", "level": "Undergrad", "course_title": "BA (Mod) Computer Science and Business, Geography, or Linguistics", "description": ""},
{"institution": "Trinity College Dublin", "level": "Postgrad", "course_title": "Structured PhD Programme", "description": ""}
]